local L = {}
local T, T1

L.COMMON        = {}
L.LOGIN         = {}
L.HALL          = {}
L.ROOM          = {}
L.STORE         = {}
L.USERINFO      = {}
L.FRIEND        = {}
L.RANKING       = {}
L.MESSAGE       = {}
L.SETTING       = {}
L.LOGINREWARD   = {}
L.HELP          = {}
L.UPDATE        = {}
L.ABOUT         = {}
L.DAILY_TASK    = {}
L.COUNTDOWNBOX  = {}
L.NEWESTACT     = {}
L.FEED          = {}
L.ECODE         = {}
L.LUCKTURN      = {}
L.SLOT          = {}
L.GIFT          = {}
L.CRASH         = {}
L.MATCH         = {}
L.E2P_TIPS      = {}
L.VIP           = {}
L.WINORLOSE     = {}
L.PRIVTE        = {}
L.ACT           = {}
L.REDBLACK      = {}
L.TUTORIAL      = {}
L.TIPS          = {}
L.SAFE          = {}
L.GOLDISLAND    = {}
L.CHECKOUTGUIDE = {}
L.BIND          = {}
L.PAYGUIDE      = {}

-- tips
L.TIPS.ERROR_INVITE_FRIEND = "เชิญเพื่อนล้มเหลว"
L.TIPS.ERROR_TASK_REWARD = "รับรางวัลภารกิจล้มเหลว"
L.TIPS.ERROR_SEND_FRIEND_CHIP = "ส่งชิปให้เพื่อนล้มเหลว"
L.TIPS.EXCEPTION_SEND_FRIEND_CHIP = "ส่งชิปให้เพื่อนล้มเหลว"
L.TIPS.ERROR_BUY_GIFT = "ส่งของขวัญล้มเหลว"
L.TIPS.ERROR_LOTTER_DRAW = "รับกล่องรางวัลลึกลับล้มเหลว"
L.TIPS.EXCEPTION_LOTTER_DRAW = "โอกาสทุบไข่ไม่พอค่ะ"
L.TIPS.ERROR_LOGIN_ROOM_FAIL = "เข้าห้องล้มเหลว กรุณาลองใหม่ทีค่ะ"
L.TIPS.ERROR_LOGIN_FACEBOOK = "ล็อกอินบัญชีเฟสบุ๊คล้มเหลว กรุณาลองใหม่ทีค่ะ"
L.TIPS.ERROR_LOGIN_FAILED = "ล็อกอินเข้าเกมล้มเหลว"
L.TIPS.ERROR_QUICK_IN = "เชื่อมต่ออินเตอร์เน็ตขัดข้อง กรุณาตรวจเช็คเน็ตของท่านก่อนค่ะ"
L.TIPS.EXCEPTION_QUICK_IN = "หาห้องนี้ไม่เจอ กรุณาลองใหม่อีกทีค่ะ"
L.TIPS.ERROR_SEND_FEEDBACK = "ฟิดแบกไม่สำเร็จ กรุณาลองทำอีกครั้งค่ะ"
L.TIPS.ERROR_FEEDBACK_SERVER_ERROR = "เซิร์ฟเวอร์ผิดปกติ ส่งฟีดแบคล้มเหลว"
L.TIPS.ERROR_MATCH_FEEDBACK = "ส่งฟีดแบคการแข่งขันล้มเหลว"
L.TIPS.EXCEPTION_ACT_LIST = "เซิร์ฟเวอร์ผิดปกติ โหลดข้อมูลกิจกรรมล้มเหลว"
L.TIPS.EXCEPTION_BACK_CHECK_PWD = "ผลการตรวจสอบ:  เซิร์ฟเวอร์ผิดปกติ"
L.TIPS.ERROR_BACK_CHECK_PWD = "การเชื่อมต่อเซิร์ฟเวอร์ผิดปกติหรือนานเกินเวลา การตรวจสอบรหัสล้มเหลว"
L.TIPS.FEEDBACK_UPLOAD_PIC_FAILED = "อัพโหลดรูปล้มเหลว！"
L.TIPS.ERROR_LEVEL_UP_REWARD = "การเชื่อมต่อเซิร์ฟเวอร์ผิดปกติหรือนานเกินเวลา รับรางวัลอัพ LV ล้มเหลว"
L.TIPS.WARN_NO_PERMISSION = "Appไม่สามารถใช้ฟังก์ชันในขณะนี้ กรุณาไห้อนุญาตในการตั้งค่าค่ะ"
L.TIPS.VIP_GIFT = "ของขวัญนี้สำหรับผู้เล่นVIPนะ"
L.TIPS.KAOPU_TIPS = "เกมส์ไม่สามารถเริ่มต้นได้ โปรดลองอีกครั้ง"
L.TIPS.INPUT_NUMBER = "โปรดกรอกหมายเลข"
L.TIPS.INPUT_NO_EMPTY = "ต้องกรอกข้อมูล "

-- COMMON MODULE
L.COMMON.LEVEL = "Lv."
L.COMMON.ASSETS = "${1}"
L.COMMON.CONFIRM = "ตกลง"--确定
L.COMMON.CANCEL = "ยกเลิก"--取消
L.COMMON.AGREE = "ตกลง"--同意
L.COMMON.REJECT = "ปฏิเสธ"--拒绝
L.COMMON.RETRY = "เชื่อมใหม่"--重连
L.COMMON.NOTICE = "ข้อความเตือน"--温馨提示
L.COMMON.BUY = "ซื้อ"--购买
L.COMMON.SEND = "ส่ง"--发送
L.COMMON.BAD_NETWORK = "เชื่อมต่ออินเตอร์เน็ตขัดข้อง กรุณาเช็คเน็ตของท่านก่อนค่ะ"--网络连接中断，请检查您的网络连接是否正常.
L.COMMON.REQUEST_DATA_FAIL = "เชื่อมต่ออินเตอร์เน็ตขัดข้อง กรุณาเช็คเน็ตของท่านก่อน แล้วกดปุ่มเชื่อมใหม่เพื่อเชื่อมต่อค่ะ"--网络连接中断，请检查您的网络连接是否正常，点击重连按钮重新连接。
L.COMMON.ROOM_FULL = "ตอนนี้มีผู้ชมในห้องมากเกินไป กรุณาเปลี่ยนห้องค่ะ"---现在该房间旁观人数过多，请换一个房间
L.COMMON.USER_BANNED = "บัญชีของท่านถูกแบนแล้ว กรุณาส่งฟีดแบคหรือติดต่อแอดมินค่ะ"---你的账户被冻结了，请你反馈或联系管理员
L.COMMON.SHARE            = "แชร์"           -- 分享
L.COMMON.GET_REWARD       = "รับรางวัล"       -- 领取奖励
L.COMMON.BUY_CHAIP        = "ซื้อชิป"          -- 购买筹码
L.COMMON.SYSTEM_BILLBOARD = 'ประกาศจากระบบ' -- 系统公告
L.COMMON.DELETE = "ลบออก"
L.COMMON.CHECK = "เช็คดู"
L.COMMON.CONGRATULATIONS = "ยินดีด้วยนะ"--恭喜你
L.COMMON.REWARD_TIPS = "ยินดีด้วย ท่านได้รับ{1}"
L.COMMON.GET = "รับ"--领取
L.COMMON.CLICK_GET = "กดและรับ"--"点击领取"
L.COMMON.ALREADY_GET = " รับแล้ว"--已领取
L.COMMON.NEXT_GET = "รับคราวหน้า"--下次领取
L.COMMON.LOGOUT = "ออกเกมส์"--登出
L.COMMON.LOGOUT_DIALOG_TITLE = "ยืนยันออกเกมส์"--确认退出登录
L.COMMON.NOT_ENOUGH_MONEY_TO_PLAY_NOW_MSG = "ชิปของคุณมีไม่ถึง {1} ชิป กรุณาไปเพิ่มชิปก่อนค่ะ "--您的筹码不足最小买入{1}，您需要补充筹码后重试。
L.COMMON.USER_SILENCED_MSG = "ท่านถูกปิดแชทแล้วค่ะ กรุณาส่งฟีดแบคเพื่อติดต่อทีมงานค่ะ" --您的帐号已被禁言，您可以在帮助-反馈里联系管理员处理
L.COMMON.USER_NEED_RELOGIN = "สะกิดเพื่อนล้มเหลว กรุณารอสักครู่ค่อยลองใหม่หรือติดต่อทีมงานค่ะ "
L.COMMON.BLIND_BIG_SMALL = "บลายด์:{1}/{2}"
L.COMMON.NOT_ENOUGH_DIAMONDS = "ขอโทษ เพชรของท่านไม่พอค่ะ!"--对不起，您的钻石不足!
L.COMMON.FANS_URL = appconfig.FANS_URL
L.COMMON.NOT_ENOUGH_MONEY = "ชิปของคุณไม่พอ กรุณาไปชื้อชิปแล้วลงไหม่ค่ะ"--"您的筹码不足，请充值后重试"
L.COMMON.NOT_FINISH = "ยังไม่เสร็จ"

-- android 右键退出游戏提示
L.COMMON.QUIT_DIALOG_TITLE = "ยืนยันออกเกมส์"--确认退出
L.COMMON.QUIT_DIALOG_MSG = "ตกลงจะออกเกมส์ไหมคะ?"--真的确认退出游戏吗？
L.COMMON.QUIT_DIALOG_MSG_A = "คุณยืนยันจะออกเกมส์ไหม รางวัลล็อกอินพรุ่งนี้รอคุณมารับนะ！"--'确定要退出了吗?明天登录还可以领取更多奖励哦!'
L.COMMON.QUIT_DIALOG_CONFIRM = "ตกลง"--忍痛退出
L.COMMON.QUIT_DIALOG_CANCEL = "เล่นต่อ"--我点错了
L.COMMON.GAME_NAMES = {
    [1] = "เท็กซัส",
    [2] = "สนามแข่ง",
    [3] = "โอมาฮ่า",
    [4] = "บาคาร่า",
    [5] = "เกทับ",
}

-- LOGIN MODULE
L.LOGIN.REGISTER_FB_TIPS = "สำหรับผู้เล่นใหม่ ล็อกอินสามครั้งแรกสามารถรับรางวัลโชคดีฟรี\nผู้เล่นล็อกอินFacebookได้รับรางลันมากกว่านี้อีก!"
L.LOGIN.FB_LOGIN = "บัญชีเฟสบุ๊ค"---FB账户登录
L.LOGIN.GU_LOGIN = "บัญชีนักท่องเที่ยว"---游客账户登录
L.LOGIN.REWARD_SUCCEED = "รับรางวัลสำเร็จ"---领取奖励成功
L.LOGIN.REWARD_FAIL = "รับรางวัลล้มเหลว"---领取失败
L.LOGIN.LOGINING_MSG = "กำลังล็อกอินเข้าเกมส์..."--正在登录游戏
L.LOGIN.CANCELLED_MSG = "ล็อกอินยกเลิกแล้ว"
L.LOGIN.DOUBLE_LOGIN_MSG = "บัญชีของท่านล็อกอินในที่อื่น"   --帐号在其他地方登录
L.LOGIN.LOGIN_DEALING = "กำลังดำเนินการล็อกอิน ไปโปรดอดใจรอหน่อยนะ"
L.LOGIN.INIT_SDK = "เกมกำลังเริ่มต้นอยู่ กรุณารอสักครู่ค่ะ"--"游戏正在初始化,请耐心等待."

-- HALL MODULE
L.HALL.USER_ONLINE = "จำนวนคนออนไลน์: {1}"----在线人数
L.HALL.INVITE_TITLE = "เชิญเพื่อน"--邀请好友
L.HALL.INVITE_FAIL_SESSION = "โหลดข้อมูลบัญชี Facebook ล้มเหลว กรุณาลองใหม่อีกครั้ง"--获取Facebook信息失败，请重试
L.HALL.SEARCH_ROOM_INPUT_ROOM_NUMBER_ERROR = "ID ห้องไม่ถูกต้องค่ะ"---你输入的房间号码有误
L.HALL.MATCH_NOT_OPEN = "สนามแข่งจะเปิดเร็วๆนี้ค่ะ"--比赛场暂未开放
L.HALL.NOT_TRACK_TIPS = "เพื่อนออฟไลน์ ติดตามไม่ได้"--"暂不在线,无法追踪"
L.HALL.TEXAS_LIMIT_LEVEL = "Lvของท่านไม่ถึง{1} กรุณาไปเล่นไพเพื่ออัพเกรดค่ะ"--"您的等级不足{1}级，请先玩牌升级后再来!"
L.HALL.TEXAS_GUIDE_TIPS_1 = "ฝีมือของท่านดีมาก อย่าตีมือไหม่ที่นี่แล้ว"--"您已经是高手了,不要在新手场虐菜了!"
L.HALL.TEXAS_GUIDE_TIPS_2 = "ฝีมือของท่านดีมาก ไปเล่นที่ห้องบลายด์ใหญ่เพื่อชนะมากกว่า"--"您已经是高手了,可以去适合您的大厂赢钱更多."
L.HALL.TEXAS_GUIDE_TIPS_3 = "ยินดีต้วยค่ะ ชิปของท่านมีมาก จะไปเล่นที่ห้องบลายด์ใหญ่ไหมคะ"--"恭喜您!您的筹码已经上升到一个新的高度,是否立即换到更高级的场玩牌?"
L.HALL.TEXAS_UPGRADE = "เล่นห้องใหญ่"--"立即提升"
L.HALL.TEXAS_STILL_ENTER = "เล่นต่อ"--"依旧进入"
L.HALL.ROOM_LEVEL_TEXT_ROOMTIP = {
    "ห้องระดับต้น", ---初级场
    "ห้องระดับกลาง", ---中级场
    "ห้องระดับสูง",----高级场
}
L.HALL.PLAYER_LIMIT_TEXT = {
    "9\nคน", --9人
    "6\nคน"--5人
}
L.HALL.CHOOSE_ROOM_TYPE = {
    "ห้องธรรมดา",
    "ห้องรวดเร็ว",
}
L.HALL.CHOOSE_ROOM_CITY_NAME = {
   "Bangkok",--曼谷
    "Seoul",--首尔
    "Kuala Lumpur",--吉隆坡
    "Shanghai",--上海

    "Moscow",--莫斯科
    "Tokyo",--东京
    "Milan",--米兰
    "Paris",--巴黎
}
L.HALL.CHOOSE_ROOM_MIN_MAX_ANTE = "น้อยสุด{1}/สูงสุด{2}"
L.HALL.CHOOSE_ROOM_BLIND = "บลายด์:{1}/{2}"
L.HALL.GIRL_SHORT_CHAT = {
    "สวัสดีค่ะ หนูเป็นสาวแจกไพ่ ชื่ออลิเซียค่ะ",--"你好，我是荷官，我叫小爱。",
    "หนูจะรอพี่ที่หองเกมส์นะ",--"我在游戏房间等你哦~",
    "เกมส์เราสนุกมาก ต้องมาเล่นบอยๆนะ",--"我们的游戏很好玩的，经常来玩吧。",
    "อร๊าย ตัวเอง พี่ทำอะไรอยู่",--"讨~厌~啦~你在做什么？",
    "ตัวเองจ๊ะ รีบไปเล่นไพ่ไวๆสิ",--"亲爱的快去打牌吧。",
    "ชอบมั๊ย  กด like ที่หน้าแฟนเพจนะ",--"喜欢吗？那就去粉丝页点个赞。",
    "คุณน่ารักมาก ขอให้คุณโชคดีนะ",--"你好可爱，祝你好运。",
    "จุ็บๆ ~(￣3￣)~",--"么么哒~ ~(￣3￣)|~",
    "อย่าลือมเชิญเพื่อนมาเล่นกันนะ ชิปฟรีแจกเอยะๆเลย",--"别忘了每天点击邀请好友一起来捧场哦！大量免费筹码赠送！",
}
L.HALL.CHOOSE_ROOM_LIMIT_LEVEL = "อันดับของคุณไม่ถึง Lv{1} กรุณาไปเล่นไพ่เท็กซัสถึง Lv{2} แล้วมาไหม่ค่ะ"
L.HALL.OMAHA_HELP_TITLE = "กติกาเกมส์โอมาฮ่า (Omaha Poker)"
L.HALL.OMAHA_RULE = [[
เกมส์ไพ่โอมาฮ่ามีกติกาที่คล้ายกับไพ่เท็กซัสโฮลด์เอ็ม แต่ผู้เล่นแต่ละคนจะได้รับไพ่โฮล4ใบ และมีไพ่ชุมชน5ใบ ผู้เล่นต้องเรียงชุดไพ่บอร์ด5ใบโดยการใช้ไพ่2ใบจากไพ่โฮล4ใบ และ3ใบจากไพ่ชุมชน5ใบที่อยู่บนโต๊ะ ชึ่งชุดไพ่ที่สูงสุดจะชนะและรับเงินกองกลาง การจัดเรียงชุดไพ่จะเหมือนกับไพ่เท็กซัส ชึ่สามารถดูรายละเอียดประเภทไพ่ที่มุมล่างซ้ายค่ะ
เมื่อเปรียบเทียบกับไพ่เท็กซัส ความสูงของไพ่โฮลจะสำคัญกว่าในไพ่โอมาฮ่า โดยปกติผู้เล่นที่มีไพ่โฮลที่ดีที่สุดมักจะเป็นผู้ชนะ

จุดแตกต่างกันของไพ่โอมาฮ่าและไพ่เท็กซัส
1.ผู้เล่นจะได้ไพ่โฮล4ใบในไพ่โอมาฮ่า ส่วบไพ่เท็กซัสไพ่โฮลจะเป็น2ใบ
2.ในไพ่โอมาฮ่าผู้เล่นต้องใช้ไพ่2ใบจากไพ่โฮล4ใบ และ3ใบจากไพ่ชุมชน5ใบที่อยู่บนกลางโต๊ะ จึงจะเป็นชุดไพ่บอร์ด5ใบ 
3.ไพ่โอมาฮ่าสามารถเริ่มเกมส์ด้วยผู้เล่นขั้นต่ำ2คน และสูงสุดไม่เกิน11คนในเมื่อไพ่เท็กซัสสูงสุดเล่นได้22ตน
]]
L.HALL.TRACE_LIMIT_LEVEL = "ไม่สามารถติดตาม ต้องถึงLv {1} จึงสามารถเข้าห้อง"--"追踪失败,需要等级达到{1}级,才可以进入房间"
L.HALL.TRACE_LIMIT_ANTE = "ไม่สามารถติดตาม ต้องมีชิปนำเข้า{1}จึงสามารถเข้าห้อง"--"追踪失败,需要携带{1}筹码,才可以进入房间"
L.HALL.OMAHA_ROOM_CITY_NAME = {
    "แคนเบอร์รา",
    "ซิดนีย์",
    "สเปน",
    "แคนาดา",
}
L.HALL.TEXAS_MUST_ROOM_CITY_NAME = {
    "ปักกิ่ง",
    "เม็กซิโก",
    "มอนทิ คาโล",
    "ลาสเวกัส",
}
L.HALL.TEXAS_MUST_TITLE = "เกทับ"
L.HALL.TEXAS_MUST_HELP_TITLE = "กติกาเกมส์ห้องเกทับ"
L.HALL.TEXAS_MUST_RULE = [[
ห้องเกทับเป็นรูปแบบใหม่ของการเล่น ผู้เล่นแต่ละคนเริ่มต้นต้องเดิมพันลายด์ 5 เท่าในแต่ละตา หม้อจะขยายได้เร็วขึ้น เงินกองกลางจะใหญ่มากขึ้น การเล่นจะสนุกมากขึ้น

ชิปที่ผู้เล่นนำเข้ามาในเกมเป็นค่าคงที่ เมื่อผู้เล่นมีชิปไม่เพียงพอก่อนเริ่มเกม ระบบจะช่วยเพิ่มซิปโดยอัตโนมัติ
]]
L.HALL.SMALL_GAME = "เกมส์อื่น"

-- ROOM MODULE
L.ROOM.OPR_TYPE = {
    "ผ่าน", --看  牌
    "หมอบ", --弃  牌
    "สู้", --跟  注
    "เกทับ", --加  注
}
L.ROOM.MY_MONEY = "My money {1} {2}"
L.ROOM.INFO_UID = "UID:{1}"
L.ROOM.INFO_LEVEL = "Lv.{1}"
L.ROOM.INFO_WIN_RATE = "อัตราชนะ {1}%"--胜率: {1}%
L.ROOM.INFO_SEND_CHIPS = "ส่งชิป"--赠送筹码
L.ROOM.ADD_FRIEND = "ติดตาม" --关注
L.ROOM.DEL_FRIEND = "เลิกติดตาม" --取消关注
L.ROOM.FORBID_CHAT = "บล็อก"
L.ROOM.CANCEL_FORBID_CHAT = "บล็อกแล้ว"
L.ROOM.NO_SEND_CHIP_TIPS = "ส่งไม่ได้ค่ะ"--"不可赠送"
L.ROOM.ADD_FRIEND_SUCC_MSG = "เพิ่มเพื่อนสำเร็จ"
L.ROOM.ADD_FRIEND_FAILED_MSG = "เพิ่มเพื่อนล้มเหลว"
L.ROOM.DELE_FRIEND_SUCCESS_MSG = "ลบเพื่อนสำเร็จ"
L.ROOM.DELE_FRIEND_FAIL_MSG = "ลบเพื่อนล้มเหลว"
L.ROOM.SEND_CHIP_NOT_NORMAL_ROOM_MSG = "ห้องนี้ส่งชิปไม่ได้ค่ะ"--当前房间不能赠送筹码
L.ROOM.SELF_CHIP_NO_ENOUGH_SEND_DELEAR = "ชิปของท่านมีไม่พอ ให้ทิปล้มเหลว"--你的筹码不够多，不足给荷官小费
L.ROOM.SEND_CHIP_NOT_IN_SEAT = "นั่งลงถึงจะสามารถให้ทิปได้ค่ะ"
L.ROOM.SEND_CHIP_NOT_ENOUGH_CHIPS = "ชิปของท่านมีไม่พอค่ะ"
L.ROOM.SEND_CHIP_TOO_OFTEN = "ท่านส่งชิปบ่อยเกินไป กรุณารอสักครู่นะ"
L.ROOM.SEND_CHIP_TOO_MANY = "ท่านส่งชิปมากเกินไปค่ะ กรุณารอสักครู่นะ"
L.ROOM.SEND_HDDJ_IN_MATCH_ROOM_MSG = "ขออภัยค่ะ ห้องแข่งขันส่งไอเทมไม่ได้"
L.ROOM.SEND_HDDJ_NOT_IN_SEAT = "นั่งลงถึงจะสามารถใช้ไอเทมได้"
L.ROOM.SEND_HDDJ_NOT_ENOUGH = "ไอเทมของท่านมีไม่พอค่ะ กรุณาไปซื้อไอเทมที่ห้างก่อนค่ะ"
L.ROOM.SEND_HDDJ_FAILED = "ส่งไอเทมล้มเหลว กรุณาลองใหม่อีกครั้ง"--"发送互动道具失败,请重试"
L.ROOM.SEND_EXPRESSION_MUST_BE_IN_SEAT = "นั่งลงถึงจะสามารถใช้อีโมได้ค่ะ"
L.ROOM.SEND_CHAT_MUST_BE_IN_SEAT = "กรุณานั่งลงก่อนนะคะ"
L.ROOM.CHAT_FORMAT = "{1}: {2}"
L.ROOM.ROOM_INFO = "{1} {2}:{3}/{4}"
L.ROOM.NORMAL_ROOM_INFO = "{1}({2}คน)  เบอร์ห้อง:{3}  บลายด์:{4}/{5}"--{1}({2}人)房间号:{3}盲注:{4}/{5}
L.ROOM.PRIVATE_ROOM_INFO = "ห้องส่วนตัว({1}คน)  เบอร์ห้อง:{2}  บลายด์:{3}/{4}"--私人房({1}人)房间号:{2}盲注:{3}/{4}
L.ROOM.PRIVTE_INFO = "ห้องนี้ยังใช้ได้ {1}"--房间剩余时间
L.ROOM.SEND_BIG_LABA_MESSAGE_FAIL = "ส่งข้อความด้วยลำโพงล้มเหลว" 
L.ROOM.NOT_ENOUGH_LABA = "ลำโพงใหญ่ของท่านไม่พอ"
L.ROOM.CHAT_MAIN_TAB_TEXT = {
    "ข้อความ", 
    "บันทึกแชท"
}
L.ROOM.USER_CARSH_REWARD_DESC = "ท่านล้มละลายแล้ว ได้รับชิปบรรเทา{1} มีสิทธิ์รับได้เพียง 3 ครั้ง/บัญชีเท่านั้น ใช้อย่างประหยัดนะคะ"
L.ROOM.USER_CARSH_BUY_CHIP_DESC = "หรือสามารถซื้อชิปได้ที่ห้างค่ะ"
L.ROOM.USER_CARSH_REWARD_COMPLETE_DESC = "ท่านได้รับชิปบรรเทาล้มละลายไปหมดแล้ว สามารถไปซื้อชิปได้ที่ห้าง และอย่าลืมมารับโบนัสที่แจกฟรีทุกๆวันนะคะ"
L.ROOM.USER_CARSH_REWARD_COMPLETE_BUY_CHIP_DESC = "แพ้ชนะเป็นเรื่องปกติ อย่ายอมแพ้นะ ไปซื้อชิปเพิ่มแล้วมาสู้กันใหม่เถอะ ขอให้โชคเข้าข้างค่ะ"
L.ROOM.WAIT_NEXT_ROUND = "รอรอบหน้า"
L.ROOM.LOGIN_ROOM_FAIL_MSG = "เข้าห้องล้มเหลว"
L.ROOM.BUYIN_ALL_POT= "ยอดชิป\nกองกลาง"
L.ROOM.BUYIN_3QUOT_POT = "3/4\nชิปกองกลาง"
L.ROOM.BUYIN_HALF_POT = "1/2\nชิปกองกลาง"
L.ROOM.BUYIN_TRIPLE = "เก 3 เท่า"
L.ROOM.CHAT_TAB_SHORTCUT = "ข้อความ"
L.ROOM.CHAT_TAB_HISTORY = "บันทึกแชท"
L.ROOM.INPUT_HINT_MSG = "กรอกข้อความ"
L.ROOM.INPUT_ALERT = "กรุณากรอกข้อความก่อนค่ะ"
L.ROOM.CHAT_SHIELD = "ท่านปิดแชทเสียงของคุณ {1} สำเร็จ"
L.ROOM.CHAT_SHORTCUT = {
    "สวัสดีจ้า",
    "เร็วๆ รอไม่ไหวแล้ว",
    "ALL IN ไปเลย !!",
    "ใจเย็นๆนะ",
    "ฝีมือสุดยอดไปเลย",
    "ใครกล้าสู้บ้าง",
    "ขอบใจที่ส่งชิปให้นะ",
    "เล่นกับคุณสนุกมากๆเลย",
    "ไพ่ไม่ดี แต่ชิปเยอะ กล้าสู้ปะ",
    "วันนี้ดวงไม่ดีเลย",
    "อย่าด่าว่ากันสิ",
    "มีแฟนยังจ๊ะ",
    "เปลี่ยนห้องดีกว่า ไพ่ไม่กินเลย",
    "ฝากเนื้อฝากตัวด้วยนะ",
    "วันนี้โชคดีจัง",
    "ส่งชิปให้หน่อยสิ",
    "สู้ตามมาเถอะ ALL IN!",
    "ข้าไปเติมเงิน เดี๋ยวมาสู้ต่อ",
    "ขอดูไพ่หน่อยสิ",
    "ขอโทษนะ ขอลาก่อนนะ"
}
L.ROOM.VOICE_TOOSHORT = "ข้อความเสียงสั้นเกินไป"
L.ROOM.VOICE_TOOLONG = "ข้อความเสียงยาวเกินไป"
L.ROOM.VOICE_RECORDING = "ยกนิ่วขึ้นเพื่อยกเลิกบันทึกเสียง"
L.ROOM.VOICE_CANCELED = "ยกเลิกการส่ง"
L.ROOM.VOICE_TOOFAST = "ดำเนินงานบ่อยเกินไป"
--荷官反馈
L.ROOM.DEALER_SPEEK_ARRAY = {
    "ขอบใจจร้า ขอให้ {1} โชคดีตลอดไปนะ!",
    "ขอบใจจร้า โชคกำลังเข้าข้างคุณนะ {1}!",
    "ขอบใจนะ คุณ {1}!",
}
--买入弹框
L.ROOM.BUY_IN_TITLE = "นำชิปเข้าห้อง"
L.ROOM.BUY_IN_BALANCE_TITLE = "ยอดชิปที่เหลือ:"
L.ROOM.BUY_IN_MIN = "นำเข้าต่ำสุด"
L.ROOM.BUY_IN_MAX = "นำเข้าสูงสุด"
L.ROOM.BUY_IN_AUTO = "ชิปไม่พอ จะนำเข้าอัตโนมัติ"
L.ROOM.BUY_IN_AUTO_MIN = "ซื้อเข้าอัตโนมัติ ชิป <น้นำเข้าต่ำสุด"
L.ROOM.BUY_IN_BTN_LABEL = "นำเข้าเพื่อนั่งลง"
L.ROOM.ADD_IN_TITLE = "เพิ่มชิป"--增加筹码
L.ROOM.ADD_IN_BTN_LABEL = "ซื้อเข้า"--确认买入
L.ROOM.ADD_IN_BTN_TIPS = "นั่งลงก่อนแล้วค่อยเพิ่มชิป"--坐下才能增加筹码
L.ROOM.ADD_IN_BTN_TIPS_2 = "ชิปของท่านไม่พอที่จะเพิ่มค่ะ"--没有多余的筹码，无法增加
L.ROOM.ADD_IN_BTN_TIPS_3 = "ชิปนำเข้าสูงสุดของห้องนี้แล้วค่ะ"
L.ROOM.ADD_IN_SUC_TIPS = "เพิ่มชิปสำเร็จ ระบบจะพิ่มชิป{1}ให้คุณอัตโนมัติในรอบหน้า"
L.ROOM.BACK_TO_HALL = "ล็อบบี้"
L.ROOM.CHANGE_ROOM = "เปลี่ยนห้อง"
L.ROOM.SETTING = "ตั้งค่า"
L.ROOM.SIT_DOWN_NOT_ENOUGH_MONEY = "ชิปของท่านไม่พอนั่งลงในห้องนี้ กรุณาเปลี่ยนห้องหรือเพิ่มชิปค่ะ"
L.ROOM.AUTO_CHANGE_ROOM = "เปลี่ยนห้อง"
L.ROOM.USER_INFO_ROOM = "ข้อมูลส่วนตัว"
L.ROOM.CHARGE_CHIPS = "เพิ่มชิป"
L.ROOM.ENTERING_MSG = "บางทีโชคดี บางทีโชคร้าย\nอยากชนะ ต้องใจร่มๆจ้า"
L.ROOM.OUT_MSG = "กำลังออกเกมส์..."--正在退出，请稍候...
L.ROOM.CHANGING_ROOM_MSG = "กำลังเปลี่ยนห้อง..."
L.ROOM.CHANGE_ROOM_FAIL = "เปลี่ยนห้องล้มเหลว ลองอีกครั้งสิคะ"
L.ROOM.STAND_UP_IN_GAME_MSG = "กำลังเล่นไพ่อยู่ ตกลงจะลุกขึ้นหรือไม่คะ"
L.ROOM.LEAVE_IN_GAME_MSG = "ท่านกำลังเล่นอยู่ ตกลงจะออกเกมส์หรือไม่คะ"--您还在当前牌局中，确认要离开吗？
L.ROOM.RECONNECT_MSG = "กำลังเชื่อมต่อเซิร์ฟเวอร์ใหม่..."
L.ROOM.OPR_STATUS = {
    "หมอบ",
    "ALL_IN",
    "สู้",
    "สู้ {1}",
    "SB",
    "BB",
    "ผ่าน",
    "เกทับ {1}",
    "เกทับ",
}
L.ROOM.AUTO_CHECK = "ผ่านอัตโนมัติ"
L.ROOM.AUTO_CHECK_OR_FOLD = "ผ่านหรือหมอบ"
L.ROOM.AUTO_FOLD = "หมอบอัตโนมัติ"
L.ROOM.AUTO_CALL_ANY = "สู้ตลอด"
L.ROOM.FOLD = "หมอบ"
L.ROOM.ALL_IN = "เททั้งหมด"
L.ROOM.CALL = "สู้"
L.ROOM.CALL_NUM = "สู้ {1}"
L.ROOM.SMALL_BLIND = "SB"
L.ROOM.BIG_BLIND = "BB"
L.ROOM.RAISE = "เกทับ"
L.ROOM.RAISE_NUM = "เกทับ {1}"
L.ROOM.CHECK = "ผ่าน"
L.ROOM.BLIND3 = "เดิมพัน\nต่ำสุดx3"
L.ROOM.BLIND4 = "เดิมพัน\nต่ำสุดx4"
L.ROOM.TABLECHIPS = "กองกลาง\n x 1"
L.ROOM.TIPS = {
    "Tips：ท่านสามารถออกเกมส์ในศูนย์การตั้งค่าค่ะ",
    "Tips：บัญชีนักท่องเที่ยวสามารถตั้งรูปประจำตัวและชื่อได้นะ",
    "Tips：ถ้าพบปัญหาใดๆ กรุณาส่งฟีดแบคค่ะ",
    "Tips：ช่องฟีดแบคอยู่ในศูนย์การตั้งค่าค่ะ",
    "Tips：ที่หน้าแฟนส์มีกิจกรรมและโบนัสเพียบเลยค่ะ",
    "Tips：ถ้าโชคไม่ดี อย่าลืมลองเปลี่ยนที่นั่งดูนะ",
    "Tips：ถ้าชอบเกมส์นี้ อย่าลืมไปเชิญเพื่อนมาเล่นด้วยกันนะ",
    "Tips：บางทีโชคดี บางทีโชคร้าย ใจร่มๆ เด๋วจะดีเอง",
    "Tips：ถ้าพบปัญหา กรุณาเก็บรูปไว้แล้วฟีดแบคมาให้เรานะ",
    "Tips：ห้องเกสองใบจะสนุกมากกว่านะ ไปสู้กันเถอะ",
    "Tips：สะสมวันล็อกอิน จะได้รับโบนัสมหาศาล",
    "Tips：คนแจกไพ่เขาเหนื่อยมากเลยนะ อย่าลืมให้ทิปเขาด้วยหล่ะ",
    "Tips：ท่านสามารถรับไอเทมในโชคดีหมุนๆหรือซื้อได้ที่ห้างค่ะ",
    "แพ้ชนะเป็นเรื่องปกติ อย่ายอมแพ้นะ", --胜负乃平常事，不要灰心。",
    "เชิญเพื่อนเข้าเกมส์สำเร็จ จะได้รับชิป", --邀请好友得筹码。
    "คนที่เก่งที่สุดคือคนที่พยายามหัดสังเกตุและอดทน", --最厉害的人是往往最有洞察力和耐心。
    "การซ้อมหรือฝึก จะนำพาไปสู่ความสำเร็จ", --熟能生巧。
    "ควบคุมอารมณ์ของคุณ ถ้าอารมณ์ีแล้ว โชคก็จะดี", --控制你的情绪，情绪好了，运气自然好。
    "วางแผนมีกลยุทธในการเล่นทุกครั้ง ไม่ใช้อารมณ์ ใช้สมอง ใช้สติและความรู้สู้",  --每局都要做技巧性的计划，不要情绪化，要用脑子、理智和知识。
    "พยายามอย่าเอามือลงเล่นมากจนเกินไป", --别玩得太多。
    "การคิดถึงความแข็งแกร่งของไพ่ในมือคู่ต่อสู้เสมอไม่ใช่ดูแต่ไพ่ในมือเรานะครับ",  --不仅要注意自己牌型的大小，更要注意对手的。
    "สำหรับมือใหม่ อย่าซ่ากระโดดเข้าไปเล่นราคาสูงทันที", --新手不要急着玩大筹码。
    "ให้จำไว้ว่า คุณกำลังเล่นไพ่ของคุณอยู่ และอย่าคิดว่าคุณสามารถควบคุมทุกอย่างได้", --要记住，打好自己的牌，不要想着控制所有的东西。
    "หมอบเมื่อได้ไพ่ไม่ดี  แล้วสู้หนักๆ เมื่อได้ไพ่ดีๆ", --牌不好的时候弃牌，牌好了再多赢点。
    "โอกาสที่จะมีคนได้ไพ่ดีๆ มีมาก", --拿到好牌的几率是大大的。
    "ไพ่ ดับเบิล A ไม่ได้ดีเสมอไป", --双A并不总是好牌。
    "ลำดับเป็นสิ่งสำคัญอย่างมากสำหรับไพ่เท็กซัส", --顺序在德州扑克是很重要的。
    "ยิ่งเงินใน pots สูงขึ้นเท่าไร expected return ของการเลือกเล่นต่อ จะสูงขึ้นด้วย", --池底钱越多，想继续玩下去要投入的成本也越大。
    "การลักไก่มีต้นทุนสูงมาก จึงไม่ควรทำบ่อยๆ", --诈唬的成本很高，不要总是用。
    "เราไม่จำเป็นที่จะต้องเอาชนะในทุกๆเกมที่ได้รับไพ่มา", --我们并不需要在拿到牌的每一局都赢。
}
L.ROOM.SHOW_HANDCARD = "เปิดไพ่"
L.ROOM.SERVER_UPGRADE_MSG = "กำลังอัพเดทเซิร์ฟเวอร์ กรุณารอสักครู่.."
L.ROOM.KICKED_BY_ADMIN_MSG = "ท่านโดนระบบเตะออกจากห้องแล้วค่ะ"
L.ROOM.KICKED_BY_USER_MSG = "ท่านโดนผู้เล่น{1}เตะออกจากห้องแล้วค่ะ"
L.ROOM.TO_BE_KICKED_BY_USER_MSG = "ท่านโดนผู้เล่น{1}เตะออกจากห้อง เกมส์รอบนี้จบจะกลับสู่ล็อบบี้อัตโนมัติค่ะ"
L.ROOM.BET_LIMIT = "แทงชิปล้มเหลว แต่ละรอบไม่สามารถแทงชิปได้มากกว่า 100M ชิปค่ะ "
L.ROOM.BET_LIMIT_1 = "แทงชิปล้มเหลว แต่ละรอบไม่สามารถแทงชิปได้มากกว่า {1} ชิปค่ะ "
L.ROOM.NO_BET_STAND_UP = "คุณไม่ได้ดำเนินงาน3ครั้ง ถูกยืนขึ้นโดยอัตโนมัติ"--"你三局未操作,已自动站起"
L.ROOM.PRE_BLIND = "ก่อน"

T = {}
L.ROOM.SIT_DOWN_FAIL_MSG = T
T["IP_LIMIT"] = "ขออภัยค่ะ  IP เดียวกันไม่สามารถนั่งได้"
T["SEAT_NOT_EMPTY"] = "ขออภัยค่ะ ที่นั่งนี้มีผู้เล่นอื่นนั่งลงแล้ว"
T["TOO_RICH"] = "ขออภัยค่ะ ท่านมีชิปเยอะเกิน ไม่ควรมาเอาเปรียบมือใหม่นะ"
T["TOO_POOR"] = "ขออภัยค่ะ ชิปไม่พอที่จะนั่งลงค่ะ"
T["NO_OPER"] = "หากท่านไม่ได้ดำเนินการใดๆมากกว่า 3 ครั้ง จะลุกขึ้นเองอัตโนมัติ กรุณานั่งลงใหม่ค่ะ"
L.ROOM.SERVER_STOPPED_MSG = "ขออภัยค่ะ กำลังปรับปรุงเซิร์ฟเวอร์อยู่  เล่นเกมส์ไม่ได้ค่ะ"
L.ROOM.GUIDEHEIGHT = "ไปห้อง {1} จะได้ชิปมากขึ้นนะ"
L.ROOM.GUIDELOW = "ไปห้อง {1} จะดีกว่านะคะ！"
L.ROOM.CARD_POWER_DESC = [[
เครื่องวัดความแข็งแรงของไพ่ ประเมินอัตราชนะขึ้นอยู่กับไพ่โฮลของผู้เล่นและหงาย สำหรับการพิจารณาเท่านั้น

ใช้ฟรีในห้องระดับสามัญ เป็นVIPจะสามารถใช้ฟรีในห้องทั้งหมด

เปิดอัตโนมัติ คุณสามารถปิดและเปิดอีกครั้งในการตั้งค่า
]]

--STORE
L.STORE.TOP_LIST = {
    "ชิป",
    "เพชร",
    "ไอเทม",
    "VIP"
}
L.STORE.NOT_SUPPORT_MSG = "บัญชีคุณไม่สนับสนุนการเติมเงินชั่วคราวค่ะ"
L.STORE.PURCHASE_SUCC_AND_DELIVERING = "ชำระเงินสำเร็จ กำลังจัดส่งสินค้า กรุณารอสักครู่ค่ะ"
L.STORE.PURCHASE_CANCELED_MSG = "ยกเลิกการชำระเงินแล้ว"
L.STORE.PURCHASE_FAILED_MSG = "การเติมเงินล้มเหลว กรุณาลองใหม่ทีค่ะ" --支付失败，请重试
L.STORE.PURCHASE_FAILED_MSG_2 = "กรุณากรอกหมายเลขและรหัสผ่านของบัตรที่ถูกต้อง"--"请输入正确卡号和密码"
L.STORE.PURCHASE_FAILED_MSG_3 = "บัตรที่ใช้แล้ว"--"此卡已经使用过"
L.STORE.PURCHASE_FAILED_MSG_4 = "บัตรนี้ใช้ไม่ได้"--"此卡无效"
L.STORE.DELIVERY_FAILED_MSG = "เน็ตไม่ดีค่ะ กรุณาลองใหม่อีกครั้ง"--网络故障，系统将在您下次打开商城时重试
L.STORE.DELIVERY_SUCC_MSG = "ส่งสินค้าเรียบร้อยแล้ว ขอบคุณค่ะ"
L.STORE.TITLE_STORE = "ห้าง"
L.STORE.TITLE_CHIP = "ชิป"
L.STORE.TITLE_PROP = "ไอเทม"
L.STORE.TITLE_MY_PROP = "ไอเทมของฉัน"
L.STORE.TITLE_HISTORY = "บันทึกการสั่งซื้อ"
L.STORE.RATE_DIAMONDS = "1{2}={1}เพชร"
L.STORE.RATE_CHIP = "1{2}={1}ชิป"
L.STORE.RATE_PROP = "1{2}={1}ไอเทม"
L.STORE.FORMAT_DIAMONDS = "{1} เพชร"
L.STORE.FORMAT_CHIP = "{1} ชิป"
L.STORE.FORMAT_PROP = "{1} ไอเทม"
L.STORE.FORMAT_HDDJ = "{1} ไอเทม"
L.STORE.FORMAT_DLB = "{1} ลำโพงใหญ่"
L.STORE.FORMAT_LPQ = "{1} บัตรของขวัญ"
L.STORE.FORMAT_DHQ = "{1} บัตรแลก"
L.STORE.FORMAT_MYB = "{1} เหรียญมด"
L.STORE.HDDJ_DESC = "สามารถใช้ไอเทมโต้ตอบ{1}ครั้ง"
L.STORE.DLB_DESC = "สามารถส่งประกาศไห้ผู้เล่นทั้งหมดในเกม{1}ครั้ง"
L.STORE.BUY = "ซื้อ"
L.STORE.USE = "ใช้"
L.STORE.BUY_DESC = "ซื้อ {1}"--"购买 {1}"
L.STORE.RECORD_STATUS = {
    "สั่งซื้อเรียบร้อย",
    "ส่งของเรียบร้อย",
    "คืนเงินเรียบร้อย"
}
L.STORE.NO_PRODUCT_HINT = "ยังไม่มีสินค้าค่ะ" 
L.STORE.NO_BUY_HISTORY_HINT = "ยังไม่มีประวัติเติมเงิน"
L.STORE.BUSY_PURCHASING_MSG = "กำลังสั่งซื้ออยู่ กรุณารอสักครู่.." --正在购买，请稍候..
L.STORE.CARD_INPUT_SUBMIT = "TOP UP"
L.STORE.BLUEPAY_CHECK = "คุณยืนยันการชำระเงิน{1} ซื้อ{2}หรือไม่?"
L.STORE.GENERATE_ORDERID_FAIL = "คำสั่งล้มเหลว กรุณาลองใหม่อีกครั้ง"--下单失败，请重试！
L.STORE.INPUT_NUM_EMPTY = "รหัสเติมเงินว่างเปล่า กรุณาป้อนใหม่อีกครั้ง"--卡号输入不能为空，请重新输入！
L.STORE.INPUT_PASSWORD_EMPTY = "รหัสผ่านว่างเปล่า กรุณาป้อนใหม่อีกครั้งค่ะ"--密码输入不能为空，请重新输入！
L.STORE.INPUT_NUM_PASSWORD_EMPTY = "รหัสเติมเงินรหัสผ่านว่างเปล่า กรุณาป้อนใหม่อีกครั้งค่ะ"--卡号或密码输入为空，请重新输入！
L.STORE.INPUT_CRAD_NUM = "กรุณาป้อนรหัสเติมเงิน"--请输入卡号
L.STORE.INPUT_CRAD_PASSWORD = "รหัสเติมเงินรหัสผ่าน"--请输入密码
L.STORE.QUICK_MORE = "ดูเพื่มเติม"
L.STORE.REAL_TAB_LIST = {
    "บัตรของขวัญ",--"礼品券"
    "บัตรแลก",--兑换券
    "เหรียญมด",--开源币
}
L.STORE.REAL_ADDRESS_BTN = "ที่อยู่"--收货地址
L.STORE.REAL_EXCHANGE_BTN = "แลก"--兑换
L.STORE.ADDRESS_POP_TITLE = "แก้ไขที่อยู่จัดส่ง"--编辑收货地址
L.STORE.REAL_TIPS = "กรุณากรอกชื่อ – นามสกุลจริง เพื่อติดต่อหากท่านได้รับรางวัล"--请务必填写真实姓名和联系方式,以便获奖后联系
L.STORE.REAL_TIPS_2 = "กรุณากรอกข้อมูลให้สมบูรณ์"--请把信息填写完整
L.STORE.REAL_SAVE = "บันทึก"--保存
L.STORE.REAL_TITLES = {
    "ชื่อ-สกุล:",--收货人:
    "เบอร์โทรศัพท์:",--手机号码:
    "ที่อยู่:",--收货地址:
    "รหัสไปรษณีย์:",--邮编:
    "อีเมลล์:"--电子邮箱:
}
L.STORE.REAL_PLACEHOLDER = {
    "ชื่อ-สกุล",--姓名
    "เบอร์โทรศัพท์:",--手机号码
    "กรุณาระบุรายละเอียดของจังหวัด เมือง เขต/อำเภอ ถนน หมายเลขบ้าน",--请务必填写详细的省.市.区(县)及街道门牌信息
    "รหัสไปรษณีย์:",--邮编
    "อีเมล"--邮箱地址
}
L.STORE.EXCHANGE_REAL_SUCCESS = "ยินดีค่ะ แลก{1}สำเร็จ เราจะจัดส่งในเร็วๆนี้ค่ะ"--"恭喜您,兑换{1}成功,我们会尽快给您发货!"
L.STORE.EXCHANGE_REAL_FAILED_1 = "{1}ของท่านไม่พอ แลก{2}ต้อนกัน{3}ค่ะ"--"你的{1}数量不足,兑换{2}需要{3}"
L.STORE.EXCHANGE_REAL_FAILED_2 = "แลกล้มเหลว กรุณาลองอีกครั้งค่ะ"--"兑换失败,请重试!"
L.STORE.TAB_LIST = {
    "ห้าง",--"商城"
    "แลกของชวัญ"--礼品兑换
}
L.STORE.CASH_CARD_TITLE = "แลกบัตรเติมเงิน"--"兑换充值卡"
L.STORE.CASH_CARD_TIPS_1 = "กรุณากรอกเบอร์โทรที่เป็นจริงและถูกต้อง\nเราจะส่งข้อมูลของบัตรเติมเงินไปยังมือถือของท่าน"--"请输入您的手机号码,务必真实有效的.\n我们将把充值卡的信息,发送到您填写的手机上."
L.STORE.CASH_CARD_TIPS_2 = "กรุณากรอกเบอร์โทรของท่าน"--"请输入您的手机号码"
L.STORE.CASH_CARD_TIPS_3 = "กรุณากรอกเบอร์โทรที่เป็น10หลัก"--"请输入10位由数字组成的电话号码"
L.STORE.CASH_CARD_TIPS_4 = "เบอร์โทรของท่านคือ{1}-{2}-{3} เราจะส่งข้อมูลบัตรเติมเงินไปยังมือถือนี้"--"您输入的电话号码是{1}-{2}-{3},我们将向此号码发送充值卡的信息."

--vip
L.VIP.SEND_EXPRESSIONS_FAILED = "ชิปของท่านมีไม่ถึง5000 ใช้อิโมVIPไม่ได้ค่ะ"--您的场外筹码不足5000，暂时无法使用VIP表情
L.VIP.SEND_EXPRESSIONS_TIPS = "ท่านยังไม่ได้ชื่อบริการVIP ต้องใช้ชิปชื้ออิโมVIP เป็น VIPทันทีก็สามารถใช้อิโมVIPฟรีและสิทธิพิเศษต่างๆ"--您还不是VIP用户,使用VIP表情需要扣除相应的筹码,成为VIP即可免费使用,还有超多优惠和特权.
L.VIP.BUY_PROP = "ชื้อไอเทม"--"购买道具"
L.VIP.OPEN_VIP = "เป็น VIP"--成为VIP
L.VIP.COST_CHIPS = "ใช้{1}ชิป"--花费{1}筹码
L.VIP.LIST_TITLE = {
    "ราคา",--价格
    -- "บัตรเตะออก",--踢人卡
    "เครื่องวัดความสูงของไพ่VIP",--VIP牌力指示器
    "ของขวัญVIP",--VIP礼物
    "ไอเทมVIP",--VIP道具
    "อิโมVIP",--VIP表情
    -- "ส่วนลดห้องพักส่วนตัว",--私人房折扣
    -- "ล้มละลาย",--破产优惠
    -- "EXP",--经验
    "รางวัลล็อกอิน",--每天登录
    "ส่งชิป",--立即赠送筹码
}
L.VIP.NOT_VIP = "ยังไม่ชื้อ"--未购买
L.VIP.AVAILABLE_DAYS = "ใช้ได้{1}วัน"--剩余{1}天
L.VIP.OPEN_BTN = "ใช้เพชร{1} เปิดรบริการ"--开通{1}钻石
L.VIP.AGAIN_BTN = "ใช้เพชร{1} ต่ออายุ"--续费{1}钻石
L.VIP.CONTINUE_BUY = "ตกลง"--继续购买
L.VIP.BROKE_REWARD = "แถม{1}% มี{2}ครั้งต่อวัน"--多送{1}% 每天{2}次
L.VIP.LOGINREWARD = "{1}*31วัน"--{1}*31天
L.VIP.PRIVATE_SALE = "ลด{1}"--{1}折
L.VIP.SEND_PROPS_TIPS_1 = "VIPใช้ไอเทมฟรี"--"互动道具VIP免费任意使用"
L.VIP.SEND_PROPS_TIPS_2 = "ไม่มีไอเทมแล้ว ต้องฝช้ชื้อบ้าง เป็น VIPทันทีก็สามารถใช้ไอเทมฟรีและสิทธิพิเศษต่างๆแล้วนะ"--"您的互动道具已用完,您可以选择花费筹码使用,成为VIP即可免费使用,还有超多优惠和特权."
-- L.VIP.KICK_CARD = "บัตรเตะออก"--踢人卡
-- L.VIP.KICK_SUCC = "踢人成功，玩家将在本局结束后被提出牌桌。"--
-- L.VIP.KICK_FAILED = "踢人失败,请稍后重试"--
-- L.VIP.KICKED_TIP = "抱歉，您被玩家{1}踢出牌局，将在本局结束后离开此牌桌。"--
-- L.VIP.KICKER_TOO_MUCH = "您当天的使用次数已达到上限，请遵守牌桌秩序，严禁恶意踢人。"--
-- L.VIP.KICKED_ENTER_AGAIN = "您已被踢出此房间，20分钟内无法进入，你可以选择其他房间或者重新快速开始"--
L.VIP.BUY_SUCCESS = "ยินดีด้วย ท่านเป็นVIPแล้วค่ะ"--恭喜你,购买VIP成功!
L.VIP.BUY_FAILED = "ชื้อVIPล้มเหลว กรุณาลองไหม่ค่ะ"--VIP购买失败,请重试
L.VIP.BUY_FAILED_TIPS = "เพชรของท่านไม่พอ กรุณาไปชื้อเพชรก่อนค่ะ"--您的钻石不足,请先购买钻石!
L.VIP.BUY_TIPS_1 = "ท่านจะใช้เพชร{2} เพื่อชื้อ{1}"--您将购买{1},需要花费{2}钻石.
L.VIP.BUY_TIPS_2 = "ตอนนี้ VIP{1}ของท่านยังไม่หมดอายุนะ ตกลงว่าจะงดใช้สิทธิพิเศษทั้งหมดของVIP{2}และเปลี่ยนเป็น VIP{3}ไหมคะ"--您目前是{1}VIP还未到期,如果您选择继续购买,将放弃现在的{2}VIP的所有特权并立即成为{3}VIP,是否继续?
L.VIP.BUY_TIPS_3 = "ท่านเป็นVIP{1} กำลังจะใช้เพชร{3}ดางเพื่อต่ออายุของบริการVIPนี้ บริการจะไช้ได้อีก{2}วันค่ะ"--您现在是{1}VIP,将对此等级VIP服务进行续费,使用期限延长{2}天,需要花费{3}钻石.
L.VIP.LEVEL_NAME = {
    "ขุนนาง",--领主
    "พระยา",--贵族
    "เจ้าพระยา",--王族
    "จักรพรรดิ"--皇族
}
L.VIP.NO_VIP_TIPS = "ท่านยังไม่ได้ชื่อVIP เป็น VIPทันทีก็สามารถใช้สิทธิพิเศษต่างๆ"--"您还不是VIP用户,是否立即成为VIP,还有超多优惠和特权."
L.VIP.CARD_POWER_TIPS = "ท่านยังไม่ได้ชื่อVIP"--"您还不是VIP用户,是否"
L.VIP.CARD_POWER_OPEN_VIP = "เป็นVIPทันที"--"立即开通"
L.VIP.VIP_AVATAR = "รูปไดนามิกVIP"--"VIP动态头像"
L.VIP.NOR_AVATAR = "รูปธรรมดา"--"普通头像"
L.VIP.SET_AVATAR_SUCCESS = "ตั้งรูปสำเร็จ"--"设置头像成功!"
L.VIP.SET_AVATAR_FAILED_1 = "ตั้งรูปล้มเหลว กรุณาลองอีกครั้ง"--"设置头像失败,请重试."
L.VIP.SET_AVATAR_FAILED_2 = "ระดับVIPของท่านไม่พอ กรุณาเลือกรูปอื่น"--"您的VIP等级不够,请选择其他头像."
L.VIP.SET_AVATAR_TIPS = [[
ท่านยังไม่ได้ชื่อVIP ไม่สามารถใช้บริการได้ เป็น VIPแล้วใช้รูปไดนามิกVIP ยังสามารถรับชิปฟรีมากขึ้นและสิทธิพิเศษต่างๆ

ชื่อVIPทันที
]]

-- login reward
L.LOGINREWARD.FB_REWARD_TIPS    = "ล็อกอินผ่านFacebook รับ"--"Facebook登录领取"
L.LOGINREWARD.FB_REWARD         = "{1}x200%={2}"
L.LOGINREWARD.REWARD_BTN        = "รับ{1}"--领取{1}
L.LOGINREWARD.GET_REWARD_FAILED = "ล็อกอินไม่สําเร็จ กรุณาลองใหม่อีกครั้ง"--签到失败，请重试!
L.LOGINREWARD.VIP_REWARD_TIPS   = "รางวัลล็อกอินVIP"--"VIP登录奖励"

-- USERINFO MODULE
L.USERINFO.MY_PROPS_TIMES="X{1}"
L.USERINFO.EXPERIENCE_VALUE = "{1}/{2}" -- 经验值
L.USERINFO.BOARD_RECORD_TAB_TEXT = {
    "ห้องธรรมดา",--常规场
    "SNG",--坐满即玩
    "MTT"--锦标赛
}
L.USERINFO.BOARD_SORT = {
    "ลำดับเวลา",
    "ลำดับชนะ"
}
L.USERINFO.NO_RECORD = "ไม่มีการบันทึก"
L.USERINFO.LAST_GAME = "รอบที่แล้ว"
L.USERINFO.NEXT_GAME = "รอบต่อไป"
L.USERINFO.PLAY_TOTOAL_COUNT = "รอบไพ่ที่เล่น: "--牌局
L.USERINFO.PLAY_START_RATE = "VPIP: " --入局率
L.USERINFO.WIN_TOTAL_RATE = "อัตราการชนะ: " --胜率
L.USERINFO.SHOW_CARD_RATE = "WTSD: " --摊牌率
L.USERINFO.MAX_CARD_TYPE = "ไพ่ชุดใหญ่สุด" --最大牌型  
L.USERINFO.JOIN_MATCH_NUM = "รอบเข้าแข่ง" --参赛次数
L.USERINFO.GET_REWARD_NUM = "รอบที่ได้รางวัล" --获奖次数
L.USERINFO.MATCH_BEST_SCORE = "อันดับสุงสุด" --锦标赛最好成绩
L.USERINFO.MY_CUP = "อันดับของฉัน" --我的奖杯
L.USERINFO.NO_CHECK_LINE = "ยังไม่ได้กรอก" --未填写
L.USERINFO.BOARD = "ดูรอบที่แล้ว" --牌局记录
L.USERINFO.MY_PACK = "กระเป๋า" --我的背包
L.USERINFO.ACHIEVEMENT_TITLE = "ผลสำเร็จ" --成就
L.USERINFO.REAL_STORE = "แลกของขวัญ"--"礼品兑换"
L.USERINFO.LINE_CHECK_NO_EMPTY = "บัญชี Line ว่างเปล่า กรุณากรอกใหม่" --Line号不能为空！请重新输入
L.USERINFO.NICK_NO_EMPTY = "ชื่อว่างเปล่า กรุณากรอกใหม่อีกครั้งค่ะ"--"名字不能为空！请重新输入"
L.USERINFO.LINE_CHECK_ONECE = "ขอยอมรับบัญชี  Line ได้หนึ่งครั้งต่อวันค่ะ" --一天只能提交一次Line认证
L.USERINFO.LINE_CHECK_FAIL = "ขอยอมรับบัญชี  Line ไม่สำเร็จ กรุณาลองทำอีกครั้งค่ะ!" --提交认证失败，请重试!
L.USERINFO.LINE_CHECK_SUCCESS = "ขอยอมรับบัญชี  Line ได้สำเร็จ" --提交认证成功
L.USERINFO.GET_BOARD_RECORD_FAIL = "รับข้อมูชนะลบุคคลล้มเหลว กรุณาปิดป๊อปอัพอีกครั้ง！"--获取个人战绩信息失败，请关闭弹窗重试
L.USERINFO.PACKAGE_INFO = {
    {
        title = "ไอเทม", --互动道具
        desc = "สามารถใช้ไอเทมอินเตอร์แอคกับผู้เล่นอื่นๆในห้อง" --可以在牌桌上对其他玩家释放的互动道具
    },
    {
        title = "ลำโพงใหญ่", --大喇叭
        desc = "สามารถบรอดคาสต์ถึงผู้เล่นทั่วโลกในเกมส์" --可以在牌桌上对全服的玩家进行广播
    },
    {
        title = "บัตรแลก",--兑换券
        desc = "ใช้จำนวนบัตรที่กำหนดไว้ แลกของขวัญที่สอดคล้องกัน"--可花费多张劵兑换相应的礼品
    },
    {
        title = "บัตรของขวัญ",--礼品券
        desc = "สามารถแลกของขวัญในบัตร"--可直接兑换券上相应的礼品
    },
    {
        title = "เหรียญมด",--开源币
        desc = "เงินตราดิจิทัลที่มีค่า"--非常有价值的一种数字货币
    },
}
L.USERINFO.MARK_TEXT = {
    "Calling\nStations",--跟注站
    "Maniacs",--疯子
    "Shark",--紧凶型
    "Mice", --紧弱型
    "Rock",--岩石型
    "Yellow\nAlert",--黄色警报
    "Fish",--松弱鱼
    "คำนิยามเอง" --自定义
}
L.USERINFO.MARK_TITLE = "มาร์ค"--标记玩家
L.USERINFO.MARK_TIPS = "คลิกเลือกปุ่มมาร์ค"--点击选中标记
L.USERINFO.MARK_SUCCESS = "มาร์คผู้เล่นสำเร็จ"--标记玩家成功
L.USERINFO.MARK_FAIL = "มาร์คผู้เล่นล้มเหลว กรุณาลองใหม่อีกครั้งค่ะ"--标记玩家失败，请重试
L.USERINFO.MARK_NO_EMPTY = "มาร์คของผู้เล่นว่างเปล่า กรุณากรอกใหม่ค่ะ"--玩家标记输入不能为空，请重新输入
L.USERINFO.UPLOAD_PIC_NO_SDCARD = "ไม่มีการ์ด SD ไม่สามารถอัปโหลดภาพค่ะ "--没有安装SD卡，无法使用头像上传功能
L.USERINFO.UPLOAD_PIC_PICK_IMG_FAIL = "ผิดพลาดในการรับภาพค่ะ"--获取图像失败
L.USERINFO.UPLOAD_PIC_UPLOAD_FAIL = "อัปโหลดภาพล้มเหลว กรุณาลองใหม่อีกครั้งค่ะ"--上传头像失败，请稍后重试
L.USERINFO.UPLOAD_PIC_IS_UPLOADING = "กำลังอัปโหลดภาพ กรุณารอสักครู่ค่ะ"--正在上传头像，请稍候...
L.USERINFO.UPLOAD_PIC_UPLOAD_SUCCESS = "อัปโหลดภาพสำเร็จ" --上传头像成功
L.USERINFO.CHOOSE_COUNTRY_TITLE = "เลือกประเทศ"
L.USERINFO.COUNTRY_LIST = {
    {
        title = "เอเชีย",
        list = {
            "สหรัฐอาหรับเอมิเรตส์",
            "มาเก๊า",
            "ปากีสถาน",
            "ฟิลิปปินส์",
            "คาซัคสถาน",
            "เกาหลี",
            "ลาว",
            "มาเลเซีย",
            "พม่า",
            "ญี่ปุ่น",
            "ไต้หวัน",
            "ไทย",
            "ฮ่องกง",
            "สิงคโปร์",
            "อิสราเอล",
            "อินเดีย",
            "อินโดนีเซีย",
            "เวียดนาม",
            "จีน",
        }
    },
    {
        title = "อเมริกาเหนือ",
        list = {
            "ปานามา",
            "คอสตาริกา",
            "คิวบา",
            "แคนาดา",
            "สหรัฐอเมริกา",
            "เม็กซิโก",
        }
    },
    {
        title = "อเมริกาใต้",
        list = {
            "อาร์เจนตินา",
            "แพรากเว",
            "บราซิล",
            "โคลอมเบีย",
            "เปรู",
            "เวเนซุเอลา",
            "อุรุกวัย",
            "ชิลี",
        }
    },
    {
        title = "ยุโรป",
        list = {
            "ออสเตรีย",
            "เบลารุส",
            "เบลเยียม",
            "โปแลนด์",
            "เยอรมัน",
            "รัสเซีย",
            "ฝรั่งเศส",
            "ฟินแลนด์",
            "เนเธอร์แลนด์",
            "สาธารณรัฐเช็ก",
            "โครเอเชีย",
            "ลิธัวเนีย",
            "โรมาเนีย",
            "โมนาโก",
            "โปรตุเกส",
            "สวีเดน",
            "สวิสเซอร์แลนด์",
            "เซอร์เบีย",
            "สโลวีเนีย",
            "ยูเครน",
            "สเปน",
            "กรีก",
            "ฮังการี",
            "อิตาลี",
            "สหราชอาณาจักร",
        }
    },
    {
        title = "โอเชียเนีย",
        list = {
            "ออสเตรเลีย",
            "นิวซีแลนด์",
        }
    },
    {
        title = "แอฟริกา",
        list = {
            "คองโก",
            "กานา",
            "ซิมบับเว",
            "แอฟริกาใต้",
            "ไนจีเรีย",
            "เซเนกัล",
        }
    },
}

-- FRIEND MODULE
L.FRIEND.TITLE = "เพื่อน"
L.FRIEND.NO_FRIEND_TIP = "ยังไม่มีเพื่อน"--暂无好友
L.FRIEND.SEND_CHIP = "ส่งชิป"
L.FRIEND.RECALL_CHIP = "สะกิด+{1}"--召回
L.FRIEND.ONE_KEY_SEND_CHIP = "ส่งชิปให้เพื่อน "
L.FRIEND.ONE_KEY_RECALL = "สะกิดทังหมด"--"一键召回"
L.FRIEND.ONE_KEY_SEND_CHIP_TOO_POOR = "จำนวนชิปของคุณครึ่งหนึ่งมีไม่ถึงจำนวนชิปที่คุณอยากจะส่ง กรุณาเติมชิปก่อนค่ะ"
L.FRIEND.ONE_KEY_SEND_CHIP_CONFIRM = "คุณยืนยันที่จะส่งชิปทั้งหมด{2}ชิปให้เพื่อน{1}ท่านของคุณหรือไม่？"
L.FRIEND.ADD_FULL_TIPS = "จำนวนเพื่อนของคุณถึงขีดกำหนด{1}ท่านแล้ว ระบบจะลบเพื่อนที่ไม่ได้เล่นไพ่เป็นเวลานานของคุณออกโดยอัตโนมัติค่ะ"
L.FRIEND.SEND_CHIP_WITH_NUM = "ส่งชิป{1}"
L.FRIEND.SEND_CHIP_SUCCESS = "ท่านส่งชิป{1}ให้เพื่อนสำเร็จ"
L.FRIEND.SEND_CHIP_PUSH = "{1} ได้ส่งชิป 10K ให้คุณ รีบมารับสิ！"
L.FRIEND.SEND_CHIP_TOO_POOR = "ชิปของท่านมีไม่พอ100k ส่งชิปล้มเหลวค่ะ"
L.FRIEND.SEND_CHIP_COUNT_OUT = "วันนี้ท่านได้ส่งชิปให้เพื่อนคนนี้ไปแล้ว พรุ่งนี้มาส่งใหม่นะ"
L.FRIEND.SELECT_ALL = "เลือกทั้งหมด"--全选
L.FRIEND.SELECT_NUM = "เลือก {1} คน"--选择{1}人
L.FRIEND.DESELECT_ALL = "ยกเลิก"--取消选择
L.FRIEND.SEND_INVITE = "เชิญเพื่อน"
L.FRIEND.INVITE_SENDED = "เชิญแล้ว"
L.FRIEND.INVITE_SUBJECT = "เกมส์นี้มันเจ๋งมาก"
L.FRIEND.CALL_FRIEND_TO_GAME = "มาเล่นไพ่ด้วยกัน  เกมสนุกดี"
L.FRIEND.INVITE_CONTENT = "เข้าเล่นเกมส์ไพ่เท็กซัสซูเปอร์ จะได้รับโบนัส $150000ทันที "..appconfig.SAHRE_URL
L.FRIEND.INVITE_SELECT_TIP = "ท่านได้เลือกเพื่อน{1}คน ส่งคำเชิญ รับชิป{2}ทันที"
L.FRIEND.INVITE_SELECT_TIP_1 = "ท่านได้เลือกเพื่อน"
L.FRIEND.INVITE_SELECT_TIP_2 = "คนส่งคำเชิญก็จะได้รับชิป"
L.FRIEND.INVITE_SELECT_TIP_3 = "ทันที"
L.FRIEND.INVITE_SUCC_TIP = "ส่งคำเชิญสำเร็จ ได้รับรางวัล {1}"
L.FRIEND.INVITE_SUCC_FULL_TIP = "ส่งคำเชิญสำเร็จ วันนี้ได้รับรางวัลเชิญเพื่อน {1} ชิปแล้วค่ะ"--"成功发送邀请，今日已获得{1}邀请发送奖励。"
L.FRIEND.INVITE_FULL_TIP = "เชิญของ Facebook ถึงขีดจำกัดแล้ว คุณยังสามารถ่งรหัสเชิญเพื่อรับชิป" --您今日已达邀请上限，请明日再发送
L.FRIEND.RECALL_SUCC_TIP = "แจกรางวัล {1} ชิป หากเพื่อนรับคำเชิญเข้าเกมส์จะได้รับ {2} ชิปเพิ่ม" --发送成功奖励{1}，好友上线后即可获赠{2}筹码奖励。
L.FRIEND.RECALL_FAILED_TIP = "ส่งคำเชิญล้มเหลว กรุณารอสักครู่ค่อยลองใหม่อีกทีค่ะ" --发送失败，请稍后重试.
L.FRIEND.INVITE_LEFT_TIP = "วันนี้ท่านยังสามารถเชิญเพื่อนได้ {1} ท่าน"--今天还可以邀请{1}个好友
L.FRIEND.CANNOT_SEND_MAIL = "ท่านยังไม่ได้ตั้งค่าอีเมล์ ไปตั้งค่าตอนนี้ไหมคะ?"
L.FRIEND.CANNOT_SEND_SMS = "ขออภัยค่ะ ส่งข้อความล้มเหลว"
L.FRIEND.MAIN_TAB_TEXT = {
    "คนที่ฉันสนใจ",--"我关注的",
    "คนที่สนใจฉัน",--"关注我的",
    "เพิ่มเพื่อน"--"更多好友"
}
L.FRIEND.INVITE_EMPTY_TIP = "กรุณาเลือกเพื่อนก่อนค่ะ"
L.FRIEND.TOO_MANY_FRIENDS_TO_ADD_FRIEND_MSG = "ท่านมีเพื่อน{1}คนแล้ว กรุณาลบเพื่อนออกบ้าง แล้วค่อยเพิ่มเพื่อนใหม่ค่ะ"
L.FRIEND.SEARCH_FRIEND = "กรุณากรอกชื่อเพื่อน FB ค่ะ" --"请输入FB好友名称"
L.FRIEND.INVITE_REWARD_TIPS_1 = "เชิญเพื่อน"
L.FRIEND.INVITE_REWARD_TIPS_2 = "ท่าน จะได้รับ"
L.FRIEND.INVITE_REWARD_TIPS_3 = "เชิญเพื่อนสำเร็จ 1 คน ท่านจะได้รับ"
L.FRIEND.SEARCH = "ค้นหา" --查找
L.FRIEND.CLEAR = "ลบ" --清除
L.FRIEND.INPUT_USER_ID = "กรอกไอดีเพื่อน" --点击输入玩家ID
L.FRIEND.INPUT_USER_ID_NO_EXIST = "ไม่มีไอดีนี้ กรุณากรอกใหม่ค่ะ" --您输入的ID不存在，请确认后重新输入
L.FRIEND.NO_SEARCH_SELF = "ไม่สามารถค้นหาไอดีของตนเองได้ กรุณากรอกใหม่ค่ะ" --无法查找自己的ID，请重新输入
L.FRIEND.NO_LINE_APP = "คุณยังไม่ได้ติดตั้ง Line กรุณาเชิญเพื่อนผ่านช่องทางอื่นค่ะ"--"您没有安装Line应用,请使用其他方式邀请"
L.FRIEND.INVITE_REWARD_TIPS = "ส่งคำเชิญไห้เพื่อนครบจำนวนคนที่กำหนดไว้ รับรางวัลใหญ่ๆ\nคลิกแพ็กเกจเพื่อดูรายละเอียด คุณได้เชิญ เพื่อน{1}คน ได้รับ{2}ชิป"--达成邀请人数还有超级大礼包赠送，可点击礼包查看详情\n您累计成功邀请了{1}位好友，获得了{2}的筹码奖励
L.FRIEND.INVITE_FB_FRIEND_TITLE = "เชิญเพื่อนFB"--邀请FB好友
L.FRIEND.INVITE_FB_FRIEND_CONTENT = "เพียงส่งคำเชิญ รับชิป{1}\nเพื่อนเข้าเกม รับชิป{2}อีก! "--每天发送就送{1}\n成功一个再送{2}筹码
L.FRIEND.INVITE_CODE_TITLE = "โคดเชิญ"--邀请码
L.FRIEND.INVITE_CODE_CONTENT = "เพื่อนเข้าเกม รับชิป{1}\nเพื่อนเชิญคอื่นเข้าเกม รับชิป{2}!"--成功就送{1}\n好友的好友再送{2}
L.FRIEND.GET_REWARD_TIPS_1 = "ยินดีด้วยนะ ท่านได้รางวัลเชิญเพื่อน" --恭喜您获得了邀请奖励!
L.FRIEND.GET_REWARD_TIPS_2 = "ต้องเชิญเพื่อนอีกคนหนึ่งจึงสามารถรับรางวัลเชิญเพื่อน  กรุณาคลิกปุ่มไปเชิญต่อนะ" --您还差{1}人才能领取奖励，点击邀请按钮继续邀请您的好友吧!
L.FRIEND.ROOM_INVITE_TITLE = "เชิญเล่นไพ่กัน"
L.FRIEND.ROOM_INVITE_SUCCTIPS = "ส่งคำเชิญแล้วค่ะ กรุณารอแป๊บหนึ่งนะคะ"
L.FRIEND.ROOM_INVITE_TAB = {
    "คนออนไลน์",
    "เพื่อน"
}
L.FRIEND.ROOM_INVITE_TIPS_CON = "{1}เชิญท่านไปเล่นไพ่กันที่{2}{3}"
L.FRIEND.ROOM_INVITE_PLAY_DES = "สนุกกับเพื่อนๆ กดปุ่มเพื่อเชิญเพื่อนๆ/กลุ่มมาเล่นกัน \n\nคลิกที่ลิงค์หรือฟื้นฟู เพื่อนก็สามารถเข้าห้องตรงๆ"

-- RANKING MODULE
L.RANKING.TITLE = "อันดับ"--"排行榜"
L.RANKING.TRACE_PLAYER = "ติดตาม" --追踪玩家
L.RANKING.GET_REWARD_BTN = "รับ" --领取 --รับแล้ว
L.RANKING.NOT_DATA_TIPS = "ยังไม่มีข้อมูลค่ะ"--暂无数据
L.RANKING.NOT_IN_CHIP_RANKING = "NO.20+ คุณยังไม่ได้เข้าสู่ลีดเดอร์ สู้ๆนะ"--"您的排名:>20名,您暂时未进入排行榜，请继续加油!"
L.RANKING.IN_RANKING = "แรงค์กิ้งของท่าน{1}  สู้ๆนะ！" --您的排名:第{1}名，再接再厉！
L.RANKING.IN_RANKING_NO_1 = "แรงค์กิ้งของท่าน 1  ไพ่เซียนที่ไม่มีใครสามารถเอาชนะได้！" --您的排名：第1名，无敌是多么寂寞！
L.RANKING.MAIN_TAB_TEXT = {
    "แรงค์กิ้งเพื่อน", --好友排行
    "แรงค์กิ้งโลก", --总排行榜
}
L.RANKING.SUB_TAB_TEXT_FRIEND = {
    "อันดับผลกำไรเมื่อวาน",--"昨日盈利榜",
    "แรงค์กิ้งชิป"--"财富榜",
}
L.RANKING.SUB_TAB_TEXT_GLOBAL = {
    "อันดับผลกำไรเมื่อวาน",--"昨日盈利榜", อันดับผลกำไร 
    "แรงค์กิ้งชิป"--"财富榜",
}

-- SETTING MODULE
L.SETTING.TITLE = "ตั้งค่า"
L.SETTING.NICK = "ชื่อ"
L.SETTING.LANGUAGE = "ภาษา"--"语言"
L.SETTING.EXCHANGE = "โคดโบนัส"
L.SETTING.LOGOUT = "ออกเกมส์"
L.SETTING.FB_LOGIN = "ล็อกอิน +19999"
L.SETTING.SOUND_VIBRATE = "เสียงและสั่น"
L.SETTING.SOUND = "เสียง"
L.SETTING.BG_SOUND = "ดนตรี"
L.SETTING.CHATVOICE = "แชทเสียง"
L.SETTING.VIBRATE = "สั่น"
L.SETTING.AUTO_SIT = "เข้าห้องนั่งลงอัตโนมัติ"
L.SETTING.AUTO_BUYIN = "ชิปไม่พอ จะนำเข้าอัตโนมัติ"
L.SETTING.CARD_POWER = "เครื่องวัดความสูงของไพ่" --牌力指示器
L.SETTING.APP_STORE_GRADE = "ชอบเกมส์นี้ ไปให้ 5 ดาวกัน"
L.SETTING.CHECK_VERSION = "ตรวจสอบเวอร์ชั่นล่าสุด"
L.SETTING.CURRENT_VERSION = "เวอร์ชั่นปัจจุบัน：V{1}"
L.SETTING.ABOUT = "เกี่ยวกับเกมส์"
L.SETTING.PUSH_NOTIFY = "การแจ้งเตือน"--"推送通知"
L.SETTING.PUSH_TIPS = [[
ระบบจะแจกชิปฟรีเยอะๆโดยสุ่ม มาก่อนได้ก่อนได้ก่อนนะ
เปิดรับการแจ้งเตือน กดพุชปุ๊บรับชิปปั๊บ

กดปุ่มตกรง–การตั้งค่า-อนุญาตการแจ้งเตือน รับชิปฟรีทันทีนะคะ
]]

--HELP
L.HELP.TITLE = "ศูนย์ความช่วยเหลือ"
L.HELP.FANS = "แฟนเพจทางการ" --官方粉丝页
L.HELP.LINE = "OpenPoker"
L.HELP.MAIN_TAB_TEXT = {
    "แนะนำการเล่น", --玩法介绍
    "อธิบายของคำ", --名词解释
    "รายละเอียด Lv", --等级说明
    "ปัญหาที่พบบ่อย", --常见问题
    "ฟิดแบก", --问题反馈
}

L.HELP.PLAY_SUB_TAB_TEXT = {
    "กติกาของเกม", --玩法说明
    "การเปรียบไพ่", --比牌规则
    "หลักสูตร", --操作说明
    "แนะนำฟังก์ชั่น", --玩牌按钮说明
}

L.HELP.LEVEL_RULE = "เล่นเกมก็จะได้เพิ่ม EXP ชนะจะได้ EXP+2 แพ้จะได้ EXP+1ต่อรอบในห้องธรรมดา รอบพิเศษจะไม่เพิ่มEXP เช่นรอบที่แข่วใน SNGและMTT " --玩牌即可获得经验,普通场入局一次赢钱 +2,输钱 +1,特殊场次玩牌不加经验,如比赛场
L.HELP.LEVEL_TITLES = {
    "เกรด", --等级
    "สมญานาม", --称号
    "EXP", --经验
    "รางวัล"  --奖励
}

L.HELP.FEED_BACK_SUB_TAB_TEXT = {
    "ปัญหาเติมเงิน",--支付问题
    "ปัญหาบัญชี",--账号问题
    "ข้อผิดในเกม",--游戏BUG
    "ข้อเสนอแนะ",--游戏建议
}

L.HELP.GAME_WORDS_SUB_TAB_TEXT = {
    "แนะนำข้อมูล", --玩法数据说明
    "ประเภทผู้เล่น", --玩家类型标注
}

L.HELP.FEED_BACK_SUCCESS = "ส่งฟีดแบคสำเร็จ" --反馈成功
L.HELP.FEED_BACK_FIAL = "ฟิดแบกไม่สำเร็จ กรุณาลองทำอีกครั้งค่ะ " --反馈失败!请重试!
L.HELP.UPLOADING_PIC_MSG = "กำลังอัพโหลดรูป..." --正在上传图片，请稍候..
L.HELP.MUST_INPUT_FEEDBACK_TEXT_MSG = "กรุณากรอกเนื้อหาฟีดแบคค่ะ" --请输入反馈内容
L.HELP.MATCH_QUESTION = "ปัญหาการแข่งขัน" --比赛问题
L.HELP.FAQ = {
    {
      "ชิปของฉันใช้หมดแล้ว แต่ก็ยังอยากเล่น ควรทำอย่างไร ？",
        "กดปุ่มชอปอยู่ที่ด้านขวาของรูปโปรไฟล์"
    },
    {
        "ทำไมฉันไม่สามารถแจกเงินในเกม ？",
        "คุณสามารถส่งชิป5000ต่อคนทุกวันบนโต๊ะ สามารถส่งชิป500ต่อคนทุกวันในรายชื่อเพื่อน"
    },
    {
        "รับชิปฟรีที่ไหนบ้าง？",
        "มีโบนัสล็อกอิน โบนัสอัพเลเวล โบนัสภารกิจ โบนัสแฟนส์ โบนัสเชิญเพื่อน เป็นต้นแล้วยังมีกิจกรรมต่างๆด้วย"
    },
    {
        "ซื้อชิปอย่างไร？",
        "กดปุ่มชอป แล้วเลือกยอดชิปที่ท่านต้องการ"
    },
    {
        "กลายเป็นแฟนส์อย่างไร？",
        "กดปุ่ม ตั้งค่า มีช่องหน้าแฟนส์ที่ข้างล่าง\nหรือกดไลค์ลิ้งก์ "..appconfig.FANS_URL.."/ ทางระบบจะแจกโบนัสแฟนส์บ่อยๆค่ะ"
    },
    {
        "ล็อกเอาท์อย่างไร？",
        "กดปุ่มตั้งค่า แล้วเลือกกด ออกระบบก็เรียบร้อยละ"
    },
    {
        "เปลี่ยนชื่อ รูปโปรไฟล์ เพศอย่างไร？",
        "กดรูปของตัวเองแล้วตั้งเปลี่ยนตามปุ่มที่โชว์ออกมา"
    },
    {
        "รหัสยืนยันบัญชี lineคืออะไร？",
        "ขอเพื่อน Line ID:OpenPokerแล้วผ่านการตรวจสอบของทีมงานแล้ว จะแสดงบัญชี lineของคุญในเกม เพื่อที่จะได้คบเพื่อนมากขึ้น"
    }
}

L.HELP.PLAY_DESC = {
    "ไพ่โฮล",--手牌
    "หงาย",--公共牌
    "บอร์ด",--成牌
    "ผู้เล่น A",--玩家A
    "ผู้เล่น B",--玩家B
    "ฟล็อป",--翻牌
    "เทิร์น",--转牌
    "ริเวอร",--和牌
    "ฟูลเฮ้าส์ WIN",--葫芦 WIN
    "2 คู่ LOSE",--两对 LOSE
}

L.HELP.PLAY_DESC_2 = "การ์ดสองใบสำหรับผู้เล่นและการ์ดชุมชน (Community Cards) 5 ใบเปิดอยู่กลางโต๊ะ ชุดของสามใบและการ์ดอีก 2 ใบตามมาใน 2 รอบ ซึ่งผู้เล่นมีทางเลือกที่จะเช็ค พนัน เพิ่มเงินเดิมพัน หรือทิ้งการ์ด ในแต่ละรอบ เมื่อการ์ดชุมชนครบ 5 ใบ จะเป็นการโชว์การ์ด ใครที่ได้การ์ดสูงสุดจะเป็นผู้ชนะ"

L.HELP.RULE_DESC = {
    "รอยัลฟลัช",-- 皇家同花顺
    "สเตรทฟลัช",--同花顺
    "โฟร์การ์ด",--四条
    "ฟูลเฮ้าส",--葫芦
    "ฟลัช",--同花
    "สเตรท",--顺子
    "ตอง",--三条
    "2 คู่",--两对
    "1 คู่",--一对
    "ไพ่สูง",--高牌
}
L.COMMON.CARD_TIPS = "ประเภทไพ่"
L.COMMON.TEXAS_CARD_TYPE = L.HELP.RULE_DESC
T = {}
L.COMMON.CARD_TYPE = T
T[1] = ""
T[2] = L.HELP.RULE_DESC[10]
T[3] = L.HELP.RULE_DESC[9]
T[4] = L.HELP.RULE_DESC[8]
T[5] = L.HELP.RULE_DESC[7]
T[6] = L.HELP.RULE_DESC[6]
T[7] = L.HELP.RULE_DESC[5]
T[8] = L.HELP.RULE_DESC[4]
T[9] = L.HELP.RULE_DESC[3]
T[10] = L.HELP.RULE_DESC[2]
T[11] = L.HELP.RULE_DESC[1]

L.HELP.RULE_DESC_NOTES = {
"ไพ่10-J-Q-K-A ที่สีเหมือนกัน",
"ไพ่เรียงลำดับ สีเดียวกัน",  
"ไพ่แต้มเหมือนกัน4ใบ",
"การได้ไพ่ทั้งตองและคู่",
"ไพ่สีเหมือนกัน5ใบ",
"ไพ่เรียงตัวเลข5ใบ",
"ไพ่ที่ตัวเลขเหมือน3ใบ",
"ไพ่1คู่2ชุด",
"ไพ่แต้มเหมือนกันสองใบ",
"ไพ่5ใบที่ไม่เหมือนกัน"
}
L.HELP.OPERATING_DESC = {
    "เมน",--主菜单
    "ซื้อชิป",--购买筹码
    "เงินกองกลาง",--池底+边池
    "ปุ่ม",--庄家
    "หงาย",--公共牌
    "ไพ่โฮล",--底牌
    "ประเภทไพ่",--牌型
    "คลิกเดิมพัน",--操作界面
    "ชิป",--带入筹码
    "ประเภทไพ่และอัตราร",--牌型大小和成牌概率
    "1 คู่",
    "เก",
    "สู",
    "หมอบ",
}

L.HELP.FEED_BACK_HINT = {
    "กรุณาให้รายละเอียดของข้อมูลการชําระเงินที่เป็นไปได้เพื่อให้เราสามารถบริการลูกค้าได้อย่างรวดเร็วสำหรับคุณเพื่อแก้ไขปัญหา",--"请尽可能提供详细的支付信息以方便我们的客服人员快速为您解决问题",
    "กรุณาให้IDของท่านเพื่อให้เราสามารถแก้ไขปัญหาอย่างรวดเร็ว โดยทั่วไป ID ผู้ใช้จะอยู่ที่ภาพด้านล่าง", --请提供您的用户ID以便我们为您解决问题，用户ID一般位于头像下方
    "ขออภัยค่ะ ปัญหาใดๆที่คุณแจ้งให้ทีมงาน เราจะช่วยแก้อย่างรวดเร็วที่สุด", --非常抱歉，您提出的任何问题我们都会第一时间给出反馈
    "ขอบคุณมากที่แจ้งข้อเสนอแนะให้กับทีมงานเรา ความคิดเห็นของท่านจะทำให้เราพัฒนาดีขึ้น", --非常欢迎您对我们提出的任何建议或者意见，您的反馈是我们持续优化的动力
}

L.HELP.PLAY_BTN_DESC = {
    {
        title="ผ่าน",--看牌
        desc="หากไม่มีการวางเดิมพันเพิ่มอีก ท่านสามาารถผ่านแล้วรอดูว่าจะมีคนอื่นวางเดิมพันหรือไม่ หากทุกคนผ่าน เกมก็จะเลื่อนไปเล่นรอบต่อไป",--在无人下注的情况下选择把决定“让”给下一位。
        type = 1
    },
    {
        title="หมอบ",--弃牌
        desc="การทิ้งไพ่ เมื่อท่านคิดว่าไพ่ในมือของท่านไม่ดีพอที่จะเล่นแล้ว",--放弃继续牌局的机会。
        type = 1
    },
    {
        title="สู",--跟注
        desc="เดิมพันที่เท่ากับเดิมพันที่วางอยู่ตอนนั้น",--跟随众人押上同等的注额
        type = 1
    },
    {
        title="เก",--加注
        desc="เดิมพันที่เป็นการเพิ่มเงินเดิมพันที่วางอยู่ในตอนนั้น",--把现有的注金抬高
        type = 1
    },
    {
        title="ALL IN",--全下
        desc="เดิมพันด้วยชิปทั้งหมดของตัวเอง",--一次把手上的筹码全部押上。
        type = 1
    },
    {
        title="ผ่านหรือหมอบ",--看或弃牌
        desc="เลือกผ่านเป็นอันดับแรก หากต้องการเดิมพันจะหมอบโดยอัตโนมัติ", --首先看牌，如果需要下注则选择弃牌
        type = 2
    },
    {
        title="หมอบ",--弃牌
        desc="หมอบอัตโนมัติ", --自动弃牌
        type = 2
    },
    {
        title="สู้ตลอด", --跟任何注
        desc="สูโดยอัตโนมัติ", --自动选择跟任何注
        type = 2
    },
}

L.HELP.PLAY_DATA_DESC = {
    {
        title="VPIP",--入池率/入局率
        desc="VPIP ย่อมาจาก Voluntarily Put $ In Potในเกมโป๊กเกอร์ย่อมาจาก 'โดยสมัครใจใส่ลงในพอต' แสดงเป็นเปอร์เซ็นต"--VPIP（通常缩写为VP）是玩家主动向底池中投入筹码的比率。
    },
    {
        title="PFR",--翻牌前加注率
        desc="PFR ย่อมาจาก Preflop Raise หมายถึงอัตราการที่ผู้เล่นเลือกเกหลังจากที่แจกไพ่ครบทุกคนแต่ก่อนรอบฟล็อป"--PFR即翻牌前加注，指的是一个玩家翻牌前加注的比率。
    },
    {
        title="AF",--激进度
        desc="AF ย่อมาจาก Aggression Factor เป็นอัตราการที่แสดงให้เห็นถึงจำนวนครั้งที่เกและเกทับ"--AF即是用来衡量一个玩家打牌激进程度的数值。
    },
    {
        title="3bet",--再次加注率
        desc="3 bet เป้นสถานการณ์ที่มีผู้เล่นเกก่อนฟลอปมา แล้วมีอีกคนเกทับ ก็จะเรียกว่าเป็น 3bet"--即在他人下注，有人加注之后的再加注，由于是一轮下注中的第三次加注，故称3bet。
    },
    {
        title="Stealing Blinds",--偷盲率
        desc="Stealing Blinds ก็คือการขโมยบลายด์ ซึ่งหมายถึงกรณีที่ผู้เล่นอยู่ตำแหน่งสาย และใช้เทคนิค raise preflop เพื่อพยายาบที่จะชนะกินเงิน บลายด"--Stealing Blinds即偷盲,是指一个玩家单纯的为了赢得盲注而加注。
    },
    {
        title="Cbet",--持续下注率
        desc="Cbet ย่อมาจาก continuetion bet กรณีที่ทุกครังที่เราเป็นฝ่าย raise preflop หากมืคนสู้ และเราเป็นฝ่ายเริ่ม bet ต่อ หรืออีกฝ่ายผ่านมาให้เราตอนฟลอปออก แล้วเราเป็นฝ่าย bet เรียกว่า Cbet"--Cbet即持续下注，是指一个玩家在前一轮主动下注或加注后，在当前这一轮再次主动下注。
    },
    {
        title="WTSD",--摊牌率
        desc="WTSD ย่อมาจาก Went to showdown เป็นอัตราการของกรณีที่ผู้เล่นได้เดิมพันถึงเปิดทั้งหมด"--WTSD即摊牌率，是指一个玩家看到翻牌圈并玩到摊牌的百分比。
    },
    {
        title="BB/100",--百手盈利率
        desc="BB ย่อมาจาก Big Blind(BB บิ๊กบลายด์) แสตงให้เห็นถึงการกำไรและขาดทุนของผู้เล่นทุก 100 รอบ"--BB/100（百手盈利率）：BB是Big Blind（大盲注）的简称，BB/100用以衡量玩家每玩100手牌局的盈亏。
    },
}

L.HELP.PLAYER_TYPE_DESC = {
    {
        title="Calling Station",--跟注站
        desc="ผู้เล่นที่เดิมพันอยู่เฉยๆ"--只会被动的跟注
    },
    {
        title="Maniacs",--疯子
        desc="ผู้เล่นที่ได้เห็น action เสมอ มักจะสู้หรือเก แทบตลอดเวลาที่มีดอกาส"--疯狂的玩家，热衷于诈唬，非常激进
    },
    {
        title="Shark",--紧凶型（鲨鱼）
        desc="ผู้เล่นที่เล่นน้อย แต่เวลาเล่นทีหนักผู้เล่นเหล่านี้ มักจะเป็นผู้เล่นที่กำไรมากที่สุด"--玩的很紧且具有一定的攻击性。
    },
    {
        title="Mice",--紧弱型（老鼠）
        desc="ผู้เล่นที่อึด ถูกลักไก่ง่าย"--玩的很紧，较胆小，容易被诈唬吓跑的玩家
    },
    {
        title="Rock",--岩石型
        desc="ผู้เล่นที่อึดที่สุดในผู้เล่นทั้งหมด เล่นน้อย ไม่ค่อยลด ไม่ค่อยเพิ่ม"--非常紧且被动。你不会在这种对手身上得到太多行动
    },
    {
        title="Yellow Alert",--黄色警报
        desc="ผู้เล่นที่เล่นมาก แต่มักจะประเมินความแข็งแกร่งของตัวเองที่สูงกว่าจริง"--玩太多牌，而且容易高估自己的牌力。
    },
    {
        title="Fish",--松弱鱼
        desc="ผู้เล่นที่อ่อนหัดที่สุดในโต๊ะ เป็นคนที่เสียเงินมากที่สุด"--玩太多牌，而翻牌后打法又很被动
    },
}

--UPDATE
L.UPDATE.TITLE = "มีเวอร์ชั่นใหม่"
L.UPDATE.DO_LATER = "ยังไม่อัพเดท"
L.UPDATE.UPDATE_NOW = "อัพเดทตอนนี้"
L.UPDATE.HAD_UPDATED = "ท่านใช้เวอร์ชั่นล่าสุดแล้ว"

--ABOUT
L.ABOUT.TITLE = "ข้อมูล"
L.ABOUT.UID = "ID เกมส์ของท่าน: {1}"
L.ABOUT.VERSION = "เวอร์ชั่น: V{1}"
L.ABOUT.FANS = "หน้าแฟนส์:\n" .. appconfig.FANS_URL
L.ABOUT.SERVICE = "เงื่อนไขการใช้บริการและนโยบายความเป็นส่วนตัว"
L.ABOUT.COPY_RIGHT = "Copyright © 2024 OpenPoker Technology CO., LTD All Rights Reserved."

--DAILY_TASK
L.DAILY_TASK.TITLE = "ภารกิจ" --任务
L.DAILY_TASK.SIGN = "ล็อกอิน" --签到
L.DAILY_TASK.GO_TO = "ไปทำ" --去完成
L.DAILY_TASK.GET_REWARD = "รับรางวัล" 
L.DAILY_TASK.HAD_FINISH = "สำเร็จ"
L.DAILY_TASK.TAB_TEXT = {
    "ภารกิจรายวัน",
    "ความสำเร็จ"
}

-- count down box
L.COUNTDOWNBOX.TITLE = "หีบสมบัติ"
L.COUNTDOWNBOX.SITDOWN = "ต้องนั่งลงก่อนถึงจะนับถอยหลังได้ค่ะ"
L.COUNTDOWNBOX.FINISHED = "วันนี้ท่านได้รับรางวัลหีบสมบัติทั้งหมดแล้ว พรุ่งนี้ยังมีอีกนะ"
L.COUNTDOWNBOX.NEEDTIME = "เล่นอีก{1}:{2} จะได้รับรางวัล{3} ชิป"
L.COUNTDOWNBOX.REWARD = "ยินดีด้วย ท่านได้รับรางวัลหีบสมบัติ{1}"
L.COUNTDOWNBOX.TIPS = "หากเชิญเพื่อนเข้าเกมส์สำเร็จ\nจะได้รับรางวัลคูณสอง"  --"成功邀请好友进游戏\n可以得到翻倍奖励"

--act
L.NEWESTACT.NO_ACT = "ยังไม่มีกิจกรรม"
L.NEWESTACT.LOADING = "ลมหายใจ กำลังโหลดรูปภาพ..."
L.NEWESTACT.TITLE = "กิจกรรมล่าสุด"
L.NEWESTACT.PLAY_CARD_TIME = "เวลากิจกรรม:{1}"
L.NEWESTACT.PLAY_CARD_TITLE = "เล่นไพ่รับรางวัลใหญ่"
L.NEWESTACT.PLAY_CARD_TIPS_1 = "คุณเล่น{1}รอบต่อ คุณจะได้รับ{2}ซิป คุณยืนยันจะลุกขึ้นหรือคะ"
L.NEWESTACT.PLAY_CARD_TIPS_2 = "คุณเล่น{1}รอบต่อ คุณจะได้รับ{2}ซิป คุณยืนยันจะออกจะเกมหรือคะ"
L.NEWESTACT.PLAY_CARD_LIST_TITLE = {
    "บลายด์",
    "เวลา",
    "รอบ",
    "รางวัล"
}
L.NEWESTACT.PAY_TIPS = "หลังจากกิจกรรมสิ้นสุดลงแล้ว ระบบจะส่งรางวัลให้คุณทางข่าว"
L.NEWESTACT.PAY_COUNT = "ได้เติมเงิน"
L.NEWESTACT.PAY_TIPS_1 = "เติมเงินเต็ม"
L.NEWESTACT.PAY_TIPS_2 = "，จะได้รับ"
L.NEWESTACT.HOLIDAY_TAB_TEXT = {
    "ที่รับ",
    "ที่แลก"
}
L.NEWESTACT.HOLIDAY_REWARD_LIMIT = "แลกได้{1}/{2}ครั้ง"
L.NEWESTACT.HOLIDAY_NO_LIMIT = "ไม่จำกัด"
L.NEWESTACT.HOLIDAY_SHAKE_TAB_TEXT = {
    "ส่งซิป",
    "เขย่า"
}
L.NEWESTACT.HOLIDAY_SHAKE_TIPS = "{1}หัวใจ={2}ครั้ง"
L.NEWESTACT.HOLIDAY_SHAKE_PLAY_TIPS = "เขย่าได้ฟรีวันละครั้ง"
L.NEWESTACT.HOLIDAY_SHAKE_TIMES = "เขย่า{1}ครั้ง"
L.NEWESTACT.HOLIDAY_SHAKE_BTN = "เขย่า"
L.NEWESTACT.HOLIDAY_SHAKE_SEND_BTN = "ส่ง"
L.NEWESTACT.HOLIDAY_SHAKE_RANKING_TITLE = {
    "แรงค์กิ้ง",
    "เด็กเลี้ยงวัว",
    "ซิปที่ส่ง",
    "เทพธิดาทอผ้า"
}
L.NEWESTACT.HOLIDAY_SHAKE_RANKING = "แรงค์กิ้ง"
L.NEWESTACT.HOLIDAY_SHAKE_RANKING_TIPS = "อัปเดตแรงค์กิ้งทุกวัน"
L.NEWESTACT.HOLIDAY_SHAKE_SEND_RECORD = "บันทึกที่ส่ง"
L.NEWESTACT.HOLIDAY_SHAKE_SEND_FRIEND = "เพื่อน"
L.NEWESTACT.HOLIDAY_SHAKE_EDIT_NAME_1 = "เทพธิดาทอผ้า"
L.NEWESTACT.HOLIDAY_SHAKE_EDIT_NAME_2 = "ซิปที่ส่ง"
L.NEWESTACT.HOLIDAY_SHAKE_EDIT_TIPS_1 = "เลือกเพื่อนหรือกรอกID"
L.NEWESTACT.HOLIDAY_SHAKE_EDIT_TIPS_2 = "ส่งต่ำสุด{1}"
L.NEWESTACT.HOLIDAY_SHAKE_EDIT_TIPS_3 = "โปรดกรอกIDของเพื่อนที่ส่ง"
L.NEWESTACT.HOLIDAY_SHAKE_EDIT_TIPS_4 = "โปรดกรอกจำนวนซิปที่ส่ง"
L.NEWESTACT.HOLIDAY_SHAKE_EDIT_TIPS_5 = "ไม่สามารถส่งซิปให้ตนเองได้"
L.NEWESTACT.HOLIDAY_SHAKE_EDIT_TIPS_6 = "จำนวนซิปที่ส่งไม่สามารถเกินจำนวนซิปของตน"
L.NEWESTACT.HOLIDAY_SHAKE_EDIT_TIPS_7 = "จำนวนซิปของท่านไม่พอ{1}"
L.NEWESTACT.HOLIDAY_SHAKE_SEND_FAILED_1 = "การส่งล้มเหลวโปรดลองอีกครั้ง"
L.NEWESTACT.HOLIDAY_SHAKE_SEND_FAILED_2 = "รหัสผู้เล่นไม่ถูกต้องโปรดส่งใหม่"

--feed
L.FEED.SHARE_SUCCESS = "แชร์สำเร็จ"
L.FEED.SHARE_FAILED = "แชร์ล้มเหลว"
L.FEED.NO_CLIENT_TIPS = "คุณยังไม่ได้ติดตั้ง {1} กรุณาเชิญเพื่อนผ่านช่องทางอื่นค่ะ"--"您没有安装{1}应用,请使用其他方式邀请"
L.FEED.COPY_TIPS = "เนื้อหาแชร์ได้คัดลอกแล้ว คุณสามารถแปะในโปรแกรมอื่นๆเพื่อส่งให้เพื่อน"
L.FEED.SHARE_LINK = appconfig.SAHRE_URL
L.FEED.WHEEL_REWARD = {
    name = "เย้ !สุดยอดเลย  ฉันได้รางวัล{ 1 }จากวงล้อโชคดีในไพ่เท็กซัสซูเปอร์  รีบมาเล่นสนุกกัน",
    caption = "วงล้อโชคดี ได้รางวัล 100%",
    link = L.FEED.SHARE_LINK .. "&feed=1",
    picture = appconfig.FEED_PIC_URL.."1.jpg",
    message = "",
}
L.FEED.WHEEL_ACT = {
    name = "มาเล่นวงล้อโชคดีกับฉัน ฟรี3 คั้งทุกวัน ได้รางวัลเอยะมากเลย",
    caption = "วงล้อโชคดี ได้รางวัล100%", 
    link = L.FEED.SHARE_LINK .. "&feed=2",
    picture = appconfig.FEED_PIC_URL.."2.jpg",
    message = "",
}
L.FEED.LOGIN_REWARD = {
    name = "ฉันได้รับชิป {1} มาสนุกกันกับเพื่อนๆในไพ่เท็กซัสซูเปอร์",
    caption = "รับโบนัสล็อกอินทุกวัน",
    link = L.FEED.SHARE_LINK .. "&feed=3",
    picture = appconfig.FEED_PIC_URL.."3.jpg",
    message = "",
}
L.FEED.INVITE_FRIEND = {
    name = "ไพ่เท็กซัสซูเปอร์ เกมไพ่ไหม่ฮ็อตที่สุด เพื่อนๆล้วนมาสนุกกันที่นี่ มาเล่นกันเร็วๆนะ",
    caption = "เกมที่ใช้ปัญญา-ไพ่เท็กซัสซูเปอร์",
    link = L.FEED.SHARE_LINK .. "&feed=4",
    picture = appconfig.FEED_PIC_URL.."4.jpg",
    message = "",
}
L.FEED.EXCHANGE_CODE = {
    name = "ฉันได้แลกรางวัล {1} ด้วยรหัสโบนัสในไพ่เท็กซัสซูเปอร์ มาเล่นกันเร็วๆนะ",
    caption = "รับรหัสแลกรางวัลทุกวัน",
    link = L.FEED.SHARE_LINK .. "&feed=5",
    picture = appconfig.FEED_PIC_URL.."5.jpg",
    message = "",
}
L.FEED.COUNT = {
    name = "เก่งนะ ฉันได้ชนะชิป {1} ในไพ่เท็กซัสซูเปอร์ ต้องอวดให้ดูหน่อย",
    caption = "ขนะใหญ่ ",
    link = L.FEED.SHARE_LINK .. "&feed=6",
    picture = appconfig.FEED_PIC_URL.."6.jpg",
    message = "",
}
L.FEED.ACTIVE = {
    name = "ฟินสุด ๆ  มาเล่นไพ่เท็กซัสซูเปอร์กับฉัน มีกิจกรรมดีๆทุกวันเลย",
    caption = " กิจกรรม {1}",
    link = L.FEED.SHARE_LINK .. "&feed=7",
    picture = appconfig.FEED_PIC_URL.."7.jpg",
    message = "",
}
L.FEED.ACTIVE_DONE = {
    name = "ฉันได้ชนะรางวัล{1} ในไพ่เท็กซัสซูเปอร์ มาเล่นกันเร็วๆนะ",
    caption = " กิจกรรม {1}",
    link = L.FEED.SHARE_LINK .. "&feed=8",
    picture = appconfig.FEED_PIC_URL.."8.jpg",
    message = "",
}
L.FEED.ACHIEVEMENT_REWARD = {
    name = "ฉันได้สำเร็จผลงาน{1}  ได้รางวัล{2} มาเล่นกับฉันนะ มาเล่นกันเร็วๆนะ",
    caption = "ผลงาน {1}",
    link = L.FEED.SHARE_LINK .. "&feed=9",
    picture = appconfig.FEED_PIC_URL.."9.jpg",
    message = "",
}
L.FEED.UPGRADE_REWARD = {
    name = "เก่งมากเลย ฉันอัพเกรดถึง LV{1} ในไพ่เท็กซัสซูเปอร์  ได้รับรางวัล{2}  มาชมหน่อยนะ",
    caption = "รางวัลอัพเกรด",
    link = L.FEED.SHARE_LINK .. "&feed=LV{1}",
    picture = appconfig.FEED_PIC_URL.."LV{1}.jpg",
    message = "",
}
L.FEED.MATCH_COMPLETE = {
    name = "ฉันได้อันดับ{2}ใน{1}ของไพ่เท็กซัสซูเปอร์  ใครมาสู้เราบ้างไหม ",
    caption = "มาแข่งในเกมด้วยกัน",
    link = L.FEED.SHARE_LINK .. "&feed=11",
    picture = appconfig.FEED_PIC_URL.."11.jpg",
    message = "",
}
L.FEED.RANK_REWARD = {
    name = "ดีใจมากจัง ฉันได้รับชิป{1} เกมของคนฉลาด กล้ามาแข่งบ้างไหม",
    caption = "ได้ชิปมากๆ",
    link = L.FEED.SHARE_LINK .. "&feed=12",
    picture = appconfig.FEED_PIC_URL.."12.jpg",
    message = "",
}
L.FEED.BIG_POKER = {
    name = "โชคดีนะ ฉันได้รูปแบบไพ่{1}  เกมของคนฉลาด  มาเล่นกันเร็วๆนะ",
    caption = "{1}",--牌型
    link = L.FEED.SHARE_LINK .. "&feed=13",
    picture = appconfig.FEED_PIC_URL.."13.jpg",
    message = "",
}
L.FEED.PRIVATE_ROOM = {
    name = "ผมได้สร้างห้องส่วนตัวเพื่อเล่นเกมใน Open Source Texas Hold'em แล้วครับ หมายเลขห้องคือ {1} และรหัสผ่านคือ {2} โปรดคลิกเพื่อเข้าร่วมทันทีครับ ",--我在开源德州扑克开好私人房等你来战，房间号{1}，密码{2}，点击立即加入！
    caption = "เปิดห้องส่วนตัวเล่นไพ่ ",-- 开房打牌了
    link = L.FEED.SHARE_LINK,
    picture = appconfig.FEED_PIC_URL.."3.jpg",
    message = "",
}
L.FEED.NO_PWD_PRIVATE_ROOM = {
    name = "ผมเปิดห้องส่วนตัวใน Open Source Texas Hold'em เพื่อรอการได้รับ挑 challenges จากคุณ หมายเลขห้องคือ {1} โปรดคลิกเพื่อเข้าร่วมทันที! ",--我在开源德州扑克开好私人房等你来战，房间号:{1}，点击立即加入！
    caption = "เปิดห้องส่วนตัวเล่นไพ่ ",--开房打牌了
    link = L.FEED.SHARE_LINK,
    picture = appconfig.FEED_PIC_URL.."3.jpg",
    message = "",
}
L.FEED.NORMAL_ROOM_INVITE = {
    name = "ฉันเล่นไพ่ใน{1}ห้อง{2} รีบมาแข่งกัน",
    caption = "มาเล่นไพ่เลย",--牌型
    link = L.FEED.SHARE_LINK,
    picture = appconfig.FEED_PIC_URL.."3.jpg",
    message = "",
}
L.FEED.INVITE_CODE = {
    name = "เกมดีๆสุดฮิตที่แนะนำให้คุณเล่นกับฉัน เข้าเกมแล้วกรอกรหัสเชิญ{1}ของฉันก็จะได้รับโบนัสพิเศษอีกทันที",--"发现一个目前最好玩的德州扑克游戏，推荐你和我一起玩，下载游戏输入我的邀请码{1}就有特别大奖领取.",
    caption = "",
    link = appconfig.INVITE_GIFT_URL,
    picture = appconfig.FEED_PIC_URL.."gift.jpg",
    message = "",
}
L.FEED.INVITE_CODE_REWARD = {
    name = "ขอบคุณเพื่อน {1}! ฉันได้รับโบนัสเชิญ {2} ใน Open Source Texas Hold'em มาเล่นกับด้วยกันนะ",--"太感谢好友XXX！我在开源德州获得了xx筹码的邀请礼包，快来加入我们一起玩吧",
    caption = "ไพ่เท็กซัสซูเปอร์ โบนัสเชิญแอยะๆที่แจกฟรี",
    link = L.FEED.SHARE_LINK .. "&feed=gift",
    picture = appconfig.FEED_PIC_URL.."gift.jpg",
    message = "",
}

-- message
L.MESSAGE.TITLE = "ข่าว"
L.MESSAGE.TAB_TEXT = {
    "ข่าวเพื่อน",--"邮    件", 
    "ข่าวระบบ"--"系统消息"
}
L.MESSAGE.EMPTY_PROMPT = "ท่านยังไม่มีข่าวสารในเวลานี"--"您现在没有消息记录"
L.MESSAGE.SEND_CHIP = "ส่งกลับ"--回赠
L.MESSAGE.ONE_KEY_GET = "รับทั้งหมด"--一键领取
L.MESSAGE.ONE_KEY_GET_AND_SEND = "รับและส่งกลับทั้งหมด"--一键领取并回赠
L.MESSAGE.GET_REWARD_TIPS = "ยินดีด้วย ท่านได้รับ{1} และส่งชิปไห้เพื่อน{2}"--"恭喜您获得了{1},成功给好友赠送了{2}"

--奖励兑换码
L.ECODE.TITLE = {
    "รหัสเชิญฉัน",
    "แลกโบนัส"
}
L.ECODE.EDITDEFAULT = "กรอกรหัสโบนัส6หลัก/รหัสเชิญ8หลัก"--"กรุณากรอกรหัสโบนัส 6-8 หลัก"--"请输入6位数字奖励兑换码或8位邀请码"
L.ECODE.FANS_DESC = "ไปหน้าแฟนส์จะได้รับโบนัสทุกๆวันนะคะ"
L.ECODE.FANS = "ลิงก์แฟนส์"
L.ECODE.EXCHANGE = "แลกโบนัส"
L.ECODE.ERROR_FAILED = "รหัสโบนัสไม่ถูกต้อง กรุณากรอกไหม่ค่ะ"
L.ECODE.ERROR_INVALID="แลกโบนัสล้มเหลว รหัสโบนัสนี้หมดอายุแล้ว"
L.ECODE.ERROR_USED = "แลกโบนัสล้มเหลว 1 รหัสใช้แลกได้แค่ 1 ครั้งเท่านั้น"
L.ECODE.ERROR_END= "แลกรางวัลล้มเหลว รางวัลถูกรับไปหมดแล้ว ครั้งหน้ามาใหม่นะ"
L.ECODE.FAILED_TIPS = "แลกโบนัสล้มเหลวกรุณาลองอีกครั้ง!"--"兑奖失败，请重试！"
L.ECODE.NO_INPUT_SELF_CODE = "กรอกรหัสเชิญตัวเองไม่ได้ กรุณากรอกอีกครั้งค่ะ"--"不能输入自己的邀请码,请重新输入"
L.ECODE.MAX_REWARD_TIPS = "รับสูงสุด"--最大获取
L.ECODE.INVITE_REWARD_TIPS = [[
1.ส่งรหัสเชิญไห้เพื่อน 
2.ไห้เพื่อนแลกรหัสเชิญของท่านภายใน3วันที่ลงทะเบียนเข้าเกม หมดอายุจะแลกไม่ได้ค่ะ
หลังจากแลกแล้วเพื่อนของท่านจะรับชิป{2} ท่านจะรับชิป{1} เพื่อนส่งรหัสเชิญไห้คนอื่นเข้าเกม คุณก็จะได้รับชิป{3}ต่อคุณ
]]
L.ECODE.INVITE_REWARD_RECORD = "คุณได้เชิญเพื่อน{1}คน ได้รับรับรางวัลเชิญ {2}"--"你已邀请了{1}位好友,获得了{2}筹码的邀请奖励"
L.ECODE.MY_CODE = "รหัสเชิญฉัน"--"我的邀请码"
L.ECODE.COPY_CODE = "คัดลอก"--"复制"
L.ECODE.INVITE_REWARD_TIPS_1 = "สุดยอด รับชิป"--"太棒了,领取成功"
L.ECODE.INVITE_REWARD_TIPS_2 = "คุณได้รับรับรางวัลเชิญ{1}\nเพื่อนคุณ {2} ได้รับรางวัลเชิญ{3}"--"您获得了{1}筹码的好友邀请奖励,您的好友{2}也获得了{3}的邀请奖励"
L.ECODE.INVITE_BTN_NAME = "ฉันอย่าไปเชิญ"--"我也要去邀请"
L.ECODE.INVITE_TIPS = "กดปุมเพื่อส่งรหัสเชิญของคุณ"--"您可以点击按钮通过以下方式发送邀请码"
L.ECODE.INVITE_TITLES = {
    "ติดตามแฟนเพจรับชิป",--"关注粉丝页获取兑换码"
    "ส่งรหัสฉันรับชิป"--"发送我的邀请码获取邀请奖励"
}

--大转盘
L.LUCKTURN.RULE_TEXT = [[
1.ได้เล่น 1 ครั้งฟรีทุก {1} ชั่วโมง
2.ใช้เพชร1ดวงได้หมุน1ครั้ง
3.ได้รางวัล 100% แจกชิปฟรีมากๆทุกวัน
]]
L.LUCKTURN.COST_DIAMOND = "ใช้เพชร 1 ดวง "--花费1个颗钻石
L.LUCKTURN.BUY_DIAMOND = "ซื้อเพชร "--购买钻石
L.LUCKTURN.COUNTDOWN_TIPS = "โอกาสฟรีใช้หมดแล้ว\n ได้เล่น 1 ครั้งฟรีหลัง {1}ชั่วโมง\n คุณยังสามารถใช้เพชร1ดวงเพื่อเล่น1ครั้ง"--您今天的免费次数已用完\n您可以等待{1}再来\n您也可以花费一颗钻石转一次
L.LUCKTURN.LOTTERY_FAILED = "ชิงรางวัลล้มเหลว กรุณาตรวจเน็ตแล้วลองไหม่อีกครั้งค่ะ "--抽奖失败，请重试
L.LUCKTURN.CHIP_REWARD_TIPS = "{1}ได้รับชิป {2}"--{1}中了:筹码{2}
L.LUCKTURN.PROPS_REWARD_TIPS = "{1}ได้รับไอเทม {2}"--{1}中了:道具{2}
L.LUCKTURN.VIP_REWARD = "{1}วัน{2}VIP"--"{1}天{2}VIP特权"

--老虎机
L.SLOT.NOT_ENOUGH_MONEY = "ชิปของท่านไม่พอค่ะ เล่นสล็อตไม่ได้"
L.SLOT.NOT_ENOUGH_MIN_MONEY ="ชิปของท่านมีไม่ถึง5K กรุณาซื้อชิปแล้วลองไหม่"--您的总筹码数不足5000，暂时无法下注老虎机，请充值后重试。
L.SLOT.BUY_FAILED = "ซื้อเข้าสล็อตล้มเหลว กรุณาลองใหม่อีกครั้งค่ะ"--"老虎机购买失败，请重试"  
L.SLOT.PLAY_WIN = "ท่านได้รับรางวัลชิป{1}"
L.SLOT.TOP_PRIZE = "ผู้เล่น{1} เล่นสล็อตได้รับรางวัล{2} ชิป"
L.SLOT.FLASH_TIP = "รางวัลสูงสุด：{1}"
L.SLOT.FLASH_WIN = "ท่านได้รับรางวัล：{1} ชิป"
L.SLOT.AUTO = "อัตโนมัติ"
L.SLOT.HELP_TIPS = "รางวัล=ชิปเดิมพัน*อัตราตอบแทน\nเดิมพันยิ่งสูง รางวัลยิ่งมาก รางวัลสูงสุด{1}"--"奖励-下注筹码*回报率\n下注越多,奖励越高.最高{1}"

--礼物
L.GIFT.TITLE = "ของขวัญ "--礼物
L.GIFT.SET_SELF_BUTTON_LABEL = "ตั้งเป็นของขวัญของฉัน"
L.GIFT.BUY_TO_TABLE_GIFT_BUTTON_LABEL = "ซื้อให้ผู้เล่น{1}คน"
L.GIFT.CURRENT_SELECT_GIFT_BUTTON_LABEL = "ของขวัญที่ท่านเลือก"
L.GIFT.PRESENT_GIFT_BUTTON_LABEL = "ส่งมอบ"
L.GIFT.DATA_LABEL = "วัน"
L.GIFT.SELECT_EMPTY_GIFT_TOP_TIP = "กรุณาเลือกของขวัญ"
L.GIFT.BUY_GIFT_SUCCESS_TOP_TIP = "ซื้อของขวัญสำเร็จ"
L.GIFT.BUY_GIFT_FAIL_TOP_TIP = "ซื้อของขวัญล้มเหลว"
L.GIFT.SET_GIFT_SUCCESS_TOP_TIP = "ตั้งของขวัญสำเร็จ"
L.GIFT.SET_GIFT_FAIL_TOP_TIP = "ตั้งของขวัญล้มเหลว"
L.GIFT.PRESENT_GIFT_SUCCESS_TOP_TIP = "ส่งของขวัญสำเร็จ"
L.GIFT.PRESENT_GIFT_FAIL_TOP_TIP = "ส่งของขวัญล้มเหลว"
L.GIFT.PRESENT_TABLE_GIFT_SUCCESS_TOP_TIP = "ส่งของขวัญให้ผู้เล่นบนโต๊ะสำเร็จ"
L.GIFT.PRESENT_TABLE_GIFT_FAIL_TOP_TIP = "ส่งของขวัญให้ผู้เล่นบนโต๊ะล้มเหลว"
L.GIFT.NO_GIFT_TIP = "ท่านยังไม่มีของขวัญค่ะ"
L.GIFT.MY_GIFT_MESSAGE_PROMPT_LABEL = "กดเลือกของขวัญที่ต้องการเพื่อประดับรูปประจำตัว"
L.GIFT.BUY_GIFT_FAIL_TIPS = "ชิปนอกห้องของคุณไม่พอ ชื้อของขวัญล้มเหลว"
L.GIFT.PRESENT_GIFT_FAIL_TIPS = "ชิปนอกห้องของคุณไม่พอ ส่งของขวัญล้มเหลว"
L.GIFT.PRESENT_TABLE_GIFT_FAIL_TIPS = "ชิปนอกห้องของคุณไม่พอ ส่งของขวัญให้ผู้เล่นบนโต๊ะล้มเหลว"
L.GIFT.SUB_TAB_TEXT_SHOP_GIFT = {
    "ของขวัญโดดเด่น", --精选
    "อาหาร", --食物
    "รถสปอร์ต", --跑车
    "ดอกไม้"  --鲜花
}

L.GIFT.SUB_TAB_TEXT_MY_GIFT = {
    "ซื้อเอง", 
    "เพื่อนส่ง",
    "ของขวัญจากระบบ"
}

L.GIFT.MAIN_TAB_TEXT = {
    "ของขวัญในห้าง", 
    "ของขวัญ VIP",
    "ของขวัญของฉัน"
} 

-- 破产
L.CRASH.PROMPT_LABEL = "ท่านได้รับชิปบรรเทาล้มละลาย{1}แล้ว และได้สิทธิ์พิเศษเข้าร่วมโปรโมชั่นจำกัดเวลาหนึ่งครั้งด้วย เชิญเพื่อนมาไล่นไพ่ก็จะได้รับชิปฟรีเยอะนะ"--您获得了{1}筹码的破产救济金，同时获得限时破产优惠充值一次，您也可以立即邀请好友获取免费筹码。
L.CRASH.THIRD_TIME_LABEL = "ครั้งสุดท้ายของท่านที่ได้รับชิปบรรเทาล้มละลาย{1}ในวันนี้\n และได้สิทธิ์เข้าร่วมโปรโมชั่นพิเศษที่จำกัดเวลาด้วย เชิญเพื่อนมาไล่นไพ่ก็จะได้รับชิปฟรีเยอะนะ"--您获得最后一次{1}筹码的破产救济金，同时获得当日限时充值优惠一次，您也可以立即邀请好友获取免费筹码。
L.CRASH.OTHER_TIME_LABEL = "ท่านได้รับชิปบรรเทาล้มละลายไปหมดแล้ว แพ้หรือชนะมันก็เรื่องแป๊บเดียว โอกาสโปรโมชั่นจำกัดเวลาพบไม่บ่อย รี่ปเติมเงินแล้วไปสู้ต่อเลยนะ"--您已经领完所有破产救济金了，输赢只是转瞬的事，限时特惠机会难得，立即充值重振雄风！
L.CRASH.TITLE = "ท่านล้มละลายแล้ว" --你破产了！
L.CRASH.REWARD_TIPS = "ล้มละลายไม่ต้องเครียด รับชิปล้มละลายแจกฟรีได้เลยค่ะ"--破产没有关系，还有救济金可以领取
L.CRASH.CHIPS = "{1}ชิป" --游戏币
L.CRASH.GET = "รับรางวัล"
L.CRASH.GET_REWARD = "ได้รับรางวัล{1}ชิป" --获得{1}
L.CRASH.GET_REWARD_FAIL = "รับชิปล้มเหลว"  --领取游戏币失败
L.CRASH.RE_SIT_DOWN = "นั่งลงอีกครั้ง"
L.CRASH.PROMPT_LABEL_1 = "อย่าท้อแท้ใจ ระบบเตรียมชิปบรรเทาล้มละลาย{1} ไห้ท่าน"
L.CRASH.PROMPT_LABEL_2 = "ตอนนี้มีโปรโมชั่นล้มละลายจำกัดเวลา1ครั้ง ฉวยโอกาสนี้ รี่ปเติมเงินแล้วสู้ต่อนะ"
L.CRASH.PROMPT_LABEL_3 = "เชิญเพื่อนไหม่ก็จะได้รับชิปฟรีเยอะๆนะ"
L.CRASH.PROMPT_LABEL_4 = "ระบบเตรียมโปรโมชั่นล้มละลายจำกัดเวลา1ครั้ง ต้องฉวยโอกาสนี้ไปเติมเงินแล้วสู้ต่อนะ"
L.CRASH.PROMPT_LABEL_5 = "ท่านได้รับชิปบรรเทาล้มละลายไปหมดแล้ว แพ้หรือชนะมันก็เรื่องแป๊บเดียว อย่าท้อแท้ใจนะ"

--E2P_TIPS
L.E2P_TIPS.SMS_SUCC = "ส่งข้อความสำเร็จ ระบบกำลังเติมเงิน กรุณารอสักครู่ค่ะ"--"短信已发送成功,正在充值 请稍等."
L.E2P_TIPS.NOT_SUPPORT = "โทรศัพท์ของท่านไม่สามารถเติมเงินผ่านช่องทาง Easy 2 Pay ได้ กรุณาเลือกช่องทางอื่นๆค่ะ"--"你的手机暂时无法完成easy2pay充值,请选择其他渠道充值"
L.E2P_TIPS.NOT_OPERATORCODE = "Easy 2 Pay ไม่สนับสนุนเครือข่ายซิมการ์ดของท่าน กรุณาเลือกช่องทางอื่นๆค่ะ"--"easy2pay暂时不支持你的手机运营商,请选择其他渠道充值"
L.E2P_TIPS.SMS_SENT_FAIL = "ส่งข้อความล้มเหลว กรุณาเช็คยอดเงินคงเหลือก่อนค่ะ"--"短信发送失败,请检查你的手机余额是否足额扣取"
L.E2P_TIPS.SMS_TEXT_EMPTY = "ไม่มีเนื้อหาในข้อความ กรุณาเลือกช่องทางอื่นและติดต่อทีมงานโบย่าค่ะ"--"短信内容为空,请选择其他渠道充值并联系官方"
L.E2P_TIPS.SMS_ADDRESS_EMPTY = "ไม่มีชื่อผู ้รับ กรุณาเลือกช่องทางอื่นๆและติดต่อทีมงานโบย่าค่ะ"--"没有发送目标,请选择其他渠道充值并联系官方"
L.E2P_TIPS.SMS_NOSIM = "ไม่มีซิมการ์ด ไม่สามารถเติมเงินผ่านช่องทาง Easy 2 Pay ได้ กรุณาเลือกช่องทางอื่นๆค่ะ"--"没有SIM卡,无法使用easy2pay渠道充值,请选择其他渠道充值"
L.E2P_TIPS.SMS_NO_PRICEPOINT = "ไม่มีชื่อผู้รับ กรุณาเลือกช่องทางอื่นๆและติดต่อทีมงานโบย่าค่ะ"--"没有发送目标,请选择其他渠道充值并联系官方"
L.E2P_TIPS.PURCHASE_TIPS = "คุณกำลังจะเติมเงิน {1} \nค่าบริการ {2} บาท(ไม่รวมภาษี7%) \nจะถูกหักออกจากเงินในมือถือของคุณ"--"您将要购买{1}，共花费{2}铢（不含7%增值税），将会从您的话费里扣除"
L.E2P_TIPS.BANK_PURCHASE_TIPS = "คุณกำลังจะเติมเงิน {1} \nค่าบริการ {2} บาท(ไม่รวมภาษี7%) \nจะถูกหักออกจากเงินในบัตรธนาคารของคุณ"--"您将要购买{1}，共花费{2}铢（不含7%增值税），将会从您的银行卡里扣除"

-- 比赛场
L.MATCH.MONEY = "ชิป"
L.MATCH.JOINMATCHTIPS = "ห้องแข่งขันที่ท่านลงชื่อกำลังจะเริ่มแข่ง เข้าห้องไปแข่งตอนนี้หรือไม่?"
L.MATCH.JOIN_MATCH_FAIL = "เข้าแข่งขันไม่สําเร็จ กรุณาสมัครการแข่งขันอื่นค่ะ"--加入比赛失败，请参加其他比赛吧！
L.MATCH.MATCH_END_TIPS = "การแข่งชันนี้สิ้นสุดแล้ว กรุณาสมัครการแข่งขันอื่นค่ะ "--当前比赛已经结束，请参加其他比赛吧！
L.MATCH.MATCHTIPSCANCEL = "ไม่แสดงอีก"
L.MATCH.CHANGING_ROOM_MSG = "กำลังรอห้องอื่นแข่งเสร็จอยู่"
L.MATCH.MATCH_NAME = "ชื่อการแข่งขัน"--比赛名称
L.MATCH.MATCH_REWARD = "รางวัล "--奖励内容
L.MATCH.MATCH_PLAYER = "คนสมัคร "--参赛人数
L.MATCH.MATCH_COST = "ค่าสมัคร+ค่าบริการ "--报名费+服务费
L.MATCH.REGISTER = "สมัคร "--报名
L.MATCH.REGISTERING = "กำลัง\nสมัคร"--"正在\n报名"
L.MATCH.REGISTERING_2 = "กำลังสมัคร"--"正在报名"
L.MATCH.UNREGISTER = "ยกเลิก\nสมัคร "--取消\n报名
L.MATCH.UNREGISTER_2 = "ยกเลิกสมัคร "--取消报名
L.MATCH.RANKING = "แรงค์กิ้งของท่าน"--"您的排名"
L.MATCH.REGISTER_COST = "ค่าสมัคร+ค่าบริการ:"--参赛费
L.MATCH.SERVER_COST = "ค่าบริการ:" --服务费
L.MATCH.TOTAL_MONEY = "ขิปของคุณ: "--您的总资产:
L.MATCH.MATCH_INFO = "การแข่งรอบนี้ "--本场赛况
L.MATCH.START_CHIPS = "ชิปเริ่มต้น:" --初始筹码
L.MATCH.START_BLIND = "บลายด์เริ่มต้น:{1}/{2}"--初始盲注{1}/{2}
L.MATCH.MATCH_TIME = "เวลาเข้าแข่ง "--参赛时间:{1}
L.MATCH.RANKING_TITLE = "อันดับ "--名次
L.MATCH.REWARD_TITLE = "รางวัล "--奖励
L.MATCH.LEVEL_TITLE = "ระดับ "--级别
L.MATCH.BLIND_TITLE = "บลายด์ "--盲注
L.MATCH.PRE_BLIND_TITLE = "เดิมพันก่อนบลายด์ "--前注
L.MATCH.ADD_BLIND_TITLE = "เวลาเพิ่มบลายด์ "--涨注时间
L.MATCH.RANKING_INFO = "อันดับ{1} "--当前排名第{1}名
L.MATCH.SNG_HELP_TITLE = "กติกาSNG " --SNG比赛规则
L.MATCH.MTT_HELP_TITLE = "กติกาMTT "-- MTT比赛规则
L.MATCH.SNG_RANKING_INFO = "ชิปเฉลี่ย {1}"--均筹: {1}
L.MATCH.MTT_RANKING_INFO = "{1}/{2} ชิปเฉลี่ย: {3}"--{1}/{2} 均筹: {3}
L.MATCH.ADD_BLIND_TIME = "เวลาเพิ่มบลายด์: {1}"--涨盲时间: {1}
L.MATCH.WAIT_MATCH = "รอเปิดเข้าแช่ง "--等待开赛
L.MATCH.ADD_BLIND_TIPS_1 = "จะเพิ่มบลายด์ในรอบหน้า "--将在下一局涨盲
L.MATCH.ADD_BLIND_TIPS_2 = "รอบหน้าจะเพิ่มบลายด์ถึง{1}/{2}"--下一局将升盲至{1}/{2}
L.MATCH.BACK_HALL = "กลับล็อบี้ "--返回大厅
L.MATCH.PLAY_AGAIN = "เล่นอีกรอบ"--再来一局
L.MATCH.LEFT_LOOK = "ชมการแข่งต่อ"--留下旁观
L.MATCH.CLOSE = "ปิด "--关闭
L.MATCH.REWARD_TIPS = "ท่านได้รางวัล{1}\n{2} "--您获得了{1}的奖励
L.MATCH.REWARD_PLAYER = "คนที่ได้รางวัล"--奖励人数
L.MATCH.MATCH_CUR_TIME = "เวลาการแข่ง"--比赛用时
L.MATCH.CUR_LEVEL_TITLE = "บลายด์ตอนนี้:{1}/{2}"--当前级别:{1}/{2}
L.MATCH.NEXT_LEVEL_TITLE = "บลายด์ต่อไป "--下一级别
L.MATCH.AVERAGE_CHIPS_TITLE = "ชิปเฉลี่ย"--平均筹码
L.MATCH.FORMAT_BLIND = "{1}/{2}"
L.MATCH.EXPECT_TIPS = "กำลังจะเปิดเร็วๆนี้ค่ะ"--敬请期待
L.MATCH.NOT_ENOUGH_MONEY = "ชิปของท่านไม่พอที่จะสมัครค่ะ กรุณาไปชื้อชิปที่ห้างแล้วสมัครอีกครั้งค่ะ"--您的筹码不足报名，请去商城补充筹码后重试
L.MATCH.PLAYER_NUM_TIPS = "รออีก {1} คนจะเริมแข่ง"--"等待开赛中，还差{1}人"
L.MATCH.PLAYER_NUM_TIPS_1 = "รออีก "
L.MATCH.PLAYER_NUM_TIPS_2 = " คนจะเริมแข่ง"
L.MATCH.MAINTAIN = "การแข่งนี้กำลังปรับปรุงอยู่ค่ะ"--"当前比赛正在维护"
L.MATCH.ROOM_INFO = "{1}:{2}/{3}"
L.MATCH.REWARD_TEXT = {
    "สุดยอดเลย！แชร์ให้เพื่อนๆเขารู้",--你太棒了！立即分享炫耀下吧！
    "ฝีมือของท่านเก่งคะนาดนี้ ต้องแชร์ให้เพื่อนๆรู้",--没想到你这么强！呼朋唤友告诉小伙伴们吧！,
    "ฝีมืสุดยอดเลย แข่งอีกรอบ！",--太牛了，再来一局吧！
}
L.MATCH.NO_REWARD_TEXT = {
    "ไม่เป็นไร สู้ๆนะ",--再接再厉，继续加油！
    "ความล้มเหลวคือแม่ของความสำเร็จ ท่านจะชนะในรอบต่อค่ะ！",--失败是成功之母，继续努力
    "อีกหน่อยก็จะชนะ ครั้งต่อไปต้องมีความอดทนมากกว่านี้นะ ",--就差一点点，下次多点耐心！
}
L.MATCH.SNG_RULE = {
    {
        title = "SNGคืออะไร",--什么是SNG-坐满即玩?
        content = "Sit and Go หรือ SNG เป็นเกมที่จำกัดผู้เล่นโดยจะเริ่มเล่นก็ต่อเมื่อจำนวนผู้เล่นครบ มีคนแข่งขันตายตัว และมีตารางเงินรางวัลที่ตายตัว เป็นเกมที่นิยมเล่นอย่างมากในการเล่นออนไลน์  โดยทั่วไปจะเล่นกันหนึ่งโต๊ะ 9（หรือ 6）คน " --SNG全称Sit and Go，中文指坐满即玩，坐满即玩是德州扑克的一种单桌比赛玩法。在SNG中，每场玩家会获得用来计数的筹码，这个筹码与金币无关，只用于本场计数。
    },
    {
        title = "กติกาSNG：", --SNG比赛规则:
        content = [[
1. เริ่มเล่นเมื่อจำนวนผู้เล่นครบ 9（หรือ 6）คน
2. ผู้เล่นทุกคนจะนำชิปสมัครเท่ากันเพื่อเข้าร่วมการแข่งขัน ชิปนี้ใช้สำหรับนับการแข่งขันรอบนี้เอง
3. ระหว่างการแข่งขันผู้เล่นไม่สามารถเพิ่มชิปได้ เมื่อผู้เล่นแพ้ชิปนำเข้าหมดแล้วจะถือว่าออกจากห้องโต๊ะ
4. จัดอันดับตามลำดับออกห้องโต๊ะของผู้เล่น  อันดับสุดท้ายจะเป็นผู้เล่นคนแรกที่แพ้ชิปนำเข้าหมด
5. การแข่งขันจะจบเมื่อห้องโต๊ะมีแต่ผู้เล่นสุดท้ายคนเดียว ถือว่าเป็นแชมป์
6. ระหว่างการแข่งขัน บลายด์จะเพิ่มขึ้นเรื่อยๆตามเวลา
]]
    }
}
L.MATCH.MTT_RULE = {
    {
        title = "MTTคืออะไร",--什么是MTT-多桌锦标赛?
        content = "MTTคำย่อของ Multi-Table Tournament เป็นการเล่นที่ผู้เล่นจะต้องจ่ายค่าเข้า แล้วจ่ายเงินรางวัลตามอันดับ เป็นทัวร์นาเมนท์ที่มีผู้เล่นมีชิปนำาข้าเท่ากันมากกว่า 1คนที่โต๊ะ และมีการแข่งขันหลายโต๊ะ จนกระทั่ง 1 ในผู้เล่นทั้งหมดชนะและได้ชิปทั้งหมด รางวัลจะถูกจ่ายในฟังก์ชั่นที่เลือกไว้ในหน้าทัวร์นาเมนท์ ซึ่งในมัลติเทเบิลทัวร์นาเมนท์จะมีการกำหนดเวลาเริ่มต้นและผู้สมัครตายตัว" --MTT是Multi-Table Tournament的缩写，中文全称为多桌锦标赛，指的是在多张桌上参赛玩家以同样的筹码量开始比赛。在多桌锦标赛中，桌子会随着选手的不断淘汰进行合并。最终，锦标赛会减少到一张桌子而进行决赛。
    },
    {
        title = "กติกาMTT", --MTT比赛规则:
        content =[[
1. มีการกำหนดเวลาเริ่มต้นและผู้สมัครตายตัว เมื่อจำนวนผู้สมัครน้อยกว่าขั้นต่ำสุด การแข่งขันจะถูกยกเลิก
2. ผู้เล่นทุกคนจะนำชิปสมัครเท่ากันเพื่อเข้าร่วมการแข่งขัน ชิปนี้ใช้สำหรับนับการแข่งขันรอบนี้เอง
3. Ante: หมายถึงกำหนดเดิมพันชิปก่อนวางบลายด์
4. Rebuy：ใน MTTแบบการรีบาย หลังจากเริ่มการแข่งขันก่อนถึงบลายด์ที่กำหนดไว้ เมื่อชิปอยู่ในมือผู้เล่นเป็นชิปเริ่มต้น ผู้เล่นสามารถ Rebuyชิปเท่ากับค่าเข้า ครั้งที่Rebuyชิปจะขึ้นอยู่กับคนละแบบของการแข่งขัน ในเวลาชิปเป็น 0 จะถูกกำจัดออกจากเกม ผู้ก็เล่นสามารถ Rebuyเพื่อเล่นต่อ
5. Add-on：ใน MTTที่มีการแอด ออน หลังจากเริ่มการแข่งขันก่อนถึงบลายด์ที่กำหนดไว้ ผู้เล่นสามารถ Add-on ชิปมากกว่าค่าเข้า ครั้งที่Add-onชิปจะขึ้นอยู่กับคนละแบบของการแข่งขัน ในเวลาชิปเป็น 0 จะถูกกำจัดออกจากเกม ผู้ก็เล่นสามารถ Add-onเพื่อเล่นต่อ
6. จัดอันดับตามลำดับการออกจากทัวร์นาเมนต์ของผู้เล่น  อันดับสุดท้ายจะเป็นผู้เล่นคนแรกที่แพ้ชิปทั้งหมด ถ้าหากผู้เล่นตั้งแต่สองคนขึ้นไปต้องออกจากการแข่งขันในรอบเดียวกัน ผู้เล่นที่มีไพ่สูงกว่าจะเป็นผู้ที่มีอันดับสูงกว่า หากความสูงของไพ่เท่ากัน ผู้เล่นที่มีชิปมากกว่าในตอนเริ่มต้นของแฮนด์นั้นจะมีอันดับสูงกว่า
7. การแข่งขันจะจบเมื่อห้องโต๊ะมีแต่ผู้เล่นสุดท้ายคนเดียว ถือว่าเป็นแชมป์
8. ระหว่างการแข่งขัน บลายด์จะเพิ่มขึ้นเรื่อยๆตามเวลา
]]
    }
}
L.MATCH.TAB_TEXT= {
    "ข้อมูลการแข่ง",--比赛信息
    "อันดับ",--排名
    "บลายด์",--盲注
    "รางวัล",--奖励
}
L.MATCH.ROOM_TAB_TEXT= {
    "ภาพรวมการแข่งขัน",--概述
    "ข้อมูลการแข่งขัน",--赛况
    "อันดับ",--排名
    "บลายด์",--盲注
    "รางวัล ",--奖励
}
L.MATCH.ROOM_TAB_TEXT_2= {
    "ข้อมูลการแข่งขัน",--赛况
    "อันดับ",--排名
    "บลายด์",--盲注
    "รางวัล",--奖励
}

-- 输赢统计
L.WINORLOSE.TITLE = "สุดยอดเลย" --太棒了
L.WINORLOSE.YING = "ชนะ" --你赢了
L.WINORLOSE.CHOUMA = "{1}ชิป" --{1}筹码
L.WINORLOSE.INFO_1 = "รอบที่เล่น:{1}"--局数:{1}
L.WINORLOSE.INFO_2 = "ได้ชนะสุงสุดรอบเดียว:{1}"--单局最大赢得:
L.WINORLOSE.RATE5 = "ถ้าชอบเกมของเรา กรุณาให้ 5 ดาวนะ ขอคุณที่สนับสนุนเกมเรา" --喜欢我们的游戏给5星好评，您的鼓励是我们持续优化的最大动力
L.WINORLOSE.NOW = "สนับสนุน" --立即支持
L.WINORLOSE.LATER = "เอาไว้ทีหลัง" --以后再说
L.WINORLOSE.SHARE = "แชร์" --分享
L.WINORLOSE.CONTINUE = "เล่นต่อ"--继续游戏

-- 私人房
L.PRIVTE.ROOM_NAME = "ห้องส่วนตัว"
L.PRIVTE.FINDTITLE = "ค้นหา ID ห้อง"
L.PRIVTE.CREATTITLE = "สร้างห้องไหม่ "
L.PRIVTE.INPUTROOMIDTIPS = "กรุณากรอก ID ห้อง"
L.PRIVTE.ENTERROOM = "เริ่มทันที"
L.PRIVTE.TYPETIPS = "เวลาเดิมพัน:\nห้องธรรมดา {1}วินาที\nห้องรวดเร็ว {2}วินาที"
L.PRIVTE.CREATEROOM = "เริมทานที"
L.PRIVTE.CREATFREE = "ฟรีจำกัดเวลา"
L.PRIVTE.INPUTPWDTIPS = "กรุณากรอกรหัสผ่านของห้องเกม เรือไม่มีรหัสผ่าน"
L.PRIVTE.TIMEHOUR = "{1}ชั่วโมง"
L.PRIVTE.PWDPOPTIPS = "กรุณากรอกรหัสผ่านที่ถูกต้อง"
L.PRIVTE.PWDPOPTITLE = "กรุณากรอกรหัส"
L.PRIVTE.PWDPOPINPUT = "กรุณากรอกรหัส"
L.PRIVTE.NOTIMETIPS = "ห้องนี้ยังใช้ได้{1}วินาที กรุณาเปิดห้องใหม่"--当前房间所剩时间{1}秒，即将解散，请重新创建！
L.PRIVTE.TIMEEND = "ห้องนี้้หมดเวลาแล้ว กรุณากลับล็อบบี้และเปิดใหม่"--当前房间时间已用完解散，请返回大厅重新创建！
L.PRIVTE.ENTERBYID = "กดเบอร์ห้องเข้าเกม"
L.PRIVTE.OWNER = "เจ้าของห้อง"
L.PRIVTE.ROOMID = "เบอร์ห้อง:{1}"
L.PRIVTE.LEFTDAY = "{1}วัน"
L.PRIVTE.LEFTHOUR = "{1}ชั่วโมง"
L.PRIVTE.LEFTMIN = "{1}นาที"
L.PRIVTE.ENTERLOOK = "ชม"
L.PRIVTE.ENTERPLAY = "นั่งลอง"
L.PRIVTE.ENTEREND = "สิ้นสุดแล้ว"
L.PRIVTE.ENTERENDTIPS = "ห้องนี้ได้หมุดเวลาแล้ว กรุณาเข้าห้องอื่นค่ะ"
L.PRIVTE.ENTERCHECK = "ท่านอยากจะเข้าห้องนี้ไหมคะ"
L.PRIVTE.CHECKCREATE = "ยังไม่มีห้อง สร้างห้องไหม่"
L.PRIVTE.ROOMMAXTIPS ="หอ้งส่วนตัวที่ท่านสร้างไว้ถึงขีดจำกัดสูงสุดแล้วค่ะ"--您创建的私人房已经达到上限！

--活动
L.ACT.CHRISTMAS_HITRATE = "อัตราความสำเร็จ{1} คอมโบมากสุด{2}"
L.ACT.CHRISTMAS_HITWIN = "สุดยอดเลย ท่านได้ชนะ{1}คนในกิจรรมนี้"
L.ACT.CHRISTMAS_FEED = {
    name = "ใครเก่งกว่า กล้ามาแข่งไหม ฉันได้รับชิป{1}และชนะ{2}คน",
    caption = "กดของขวัญรับชิป100%",
    link = L.FEED.SHARE_LINK .. "&feed=14",
    picture = appconfig.FEED_PIC_URL.."14.jpg",
    message = "",
}
L.ACT.CHRISTMAS_HALL_GIRL_CHAT_1 = "สุขสันต์วันคริสต์มาสเขย่าโทรศัพท์เพื่อกดของขวัญ"
L.ACT.CHRISTMAS_HALL_GIRL_CHAT_2 = "สุขสันต์วันปีใหม่เขย่าโทรศัพท์เพื่อกดของขวัญ"
L.ACT.CHRISTMAS_HALL_GIRL_CHAT_3 = "ของขวัญจะมาแล้วเตรียมดีๆเพื่อกดเยอะๆนะ"
L.ACT.CHRISTMAS_HALL_GIRL_CHAT_4 = "โอกาสในวันนี้หมดแล้วพรุ่งนี้ค่อยมาไหม่นะคะ"
L.ACT.CHRISTMAS_HALL_GIRL_CHAT_5 = "สุขสันต์วันตรุษจีน เขย่าโทรศัพท์กดของขวัญ"
L.ACT.CHRISTMAS_HALL_GIRL_CHAT_6 = "สุขสันต์วันแห่งความรัก รีบเขย่าโทรศัพท์ เพื่อกดของขวัญใหญ่ๆนะ"

--红黑大战
L.REDBLACK.BET_DOUBLE = "2เท่า"--"加倍"
L.REDBLACK.BET_LAST = "แทงเท่าเดิม"--"重复上局"
L.REDBLACK.SELECTED_BET_TIPS = "กรุณาเลือกเขตเดิมพัน"--"请选择幸运区域"
L.REDBLACK.SELECTED_BET_END_TIPS = "เลือกแล้วค่ะ"--"选择完毕"
L.REDBLACK.START_GAME_TIPS = "กำลังจะเริ่มต้น({1})"--"游戏即将开始({1})"
L.REDBLACK.BET_FAILD = "ชิปของท่านไม่พอ เดิมพันล้มเหลว"--"您的游戏币不足,下注失败"
L.REDBLACK.BET_FAILD_2 = "ขิปของท่านไหม่พอ{1} เปลี่ยนโดยอัตโนมัติเป็น{2}"--"您的游戏币不足当前所选的下注额度{1}，已经自动切换到{2}"
L.REDBLACK.BET_FAILD_TIMES_OUT = "เวลาเติมพันหมดแล้ว เดิมพันล้มเหลว"--"下注时间已到,下注失败"
L.REDBLACK.BET_LIMIT_TIPS = "เดิมพันล้มเหลว ไม่สามารถเติมพันเกิน{1}"--"下注失败，当局下注不能超过{1}"
L.REDBLACK.ALL_PLAYER = "มี {1} คนในห้องนี้"--"当前房间共有{1}人"
L.REDBLACK.RECENT_TREND = "แนวโน้มเร็วๆนี้"--"近期走势"
L.REDBLACK.TODAY_COUNT = "สถิติวันนี้"--"今日统计"
L.REDBLACK.WIN_LOSE = "แพ้ชนะ"--"胜负"
L.REDBLACK.HAND_CARD = "ไพ่โฮล"--"手牌"
L.REDBLACK.WIN_CARD_TYPE = "ไพ่ชนะ"--"获胜牌型"
L.REDBLACK.COUNT_TIPS_1 = "ช้างทองชนะ:{1}"--"金象胜利:{1}"
L.REDBLACK.COUNT_TIPS_2 = "ช้างเงินชนะ:{1}"--"银象胜利:{1}"
L.REDBLACK.COUNT_TIPS_3 = "เสมอกัน:{1}"--"平局:{1}"
L.REDBLACK.COUNT_TIPS_4 = "ไพ่ฟลัชติดกัน:{1}"--"同花连牌:{1}"
L.REDBLACK.COUNT_TIPS_5 = "AA:{1}"--"对A:{1}"
L.REDBLACK.COUNT_TIPS_6 = "ฟูลเฮ้าส์:{1}"--"葫芦:{1}"
L.REDBLACK.COUNT_TIPS_7 = "โฟร์การ์ด/สเตรทฟลั/รอยัลฟลัช:{1}"--"金刚/皇家/同花顺:{1}"
L.REDBLACK.SUB_TAB_TEXT = {
    "แนวโน้มแพ้ชนะ",--"胜负走势",
    "กติกา"--"游戏规则"
}
L.REDBLACK.RULE = [[
กติกาบาคาร่า


เลือกช้างเพื่อรับรางวัล
1. แต่ละรอบระบบจะแจกไพ่โฮล2ใบไห้กับช้างเงิน&ช้างทอง แล้วจะแจกไพ่ชุมชน5ใบที่ใบแรกเป็น เปิดเผย

2. ผู้เล่นสามารถเดิมพันช้างหรือรูปแบบไพ่ใดๆที่ตนคิดว่าจะขนะ

3. หากแทงถูก จะได้รับรางวัลเดิมพันตามที่ระบบกำหนดไว้โดยอัตโนมัติ


ชิปที่เดิมพันมีขีดจำกัดในทุกวัน ต้องคิดกลยุทธ์เดิมพันที่เหมาะสมนะคะ
]]

--新手引导
L.TUTORIAL.SETTING_TITLE = "การสอนมือไหม่"
L.TUTORIAL.FIRST_IN_TIPS = [[
ยินดีต้อนรับมาสู่ไพ่เท็กซัสซูเปอร์
ไพ่เท็กซัสหรือเท็กซัสโฮลเด็ม(Texas Hold'em) เป็นเกมส์ไพ่ที่ยอดนิยมทั่วโลก หากคุณรู้จักวิธีการเล่นหลักอยู่แล้ว สามารถข้ามบทนำนี้ ถ้าไม่ใช่ เลือกที่จะเริ่มต้นได้
รับ8000ชิปเมื่อครั้งแรกที่เรียนการสอนมือไหม่
]]
L.TUTORIAL.FIRST_IN_BTN1 = "ข้าม"
L.TUTORIAL.FIRST_IN_BTN2 = "เริ่ม"
L.TUTORIAL.END_AWARD_TIPS = "เรียนสำเร็จ รับชิป"
L.TUTORIAL.FINISH_AWARD_TIPS = "ยินดีด้วย คุณได้รับรับรางวัลการสอนมือไหม่{1}ชิป คุณสามรถเรียนอีกครั้งหรือไปเล่นไพ่ทันที"
L.TUTORIAL.FINISH_NOAWARD_TIPS = "คุณเก่งในไพ่เท็กซัสอยู่แล้ว คุณสามรถเรียนอีกครั้งหรือไปเล่นไพ่ทันที"
L.TUTORIAL.FINISH_FIRST_BTN = "เรียนอีกครั้ง"
L.TUTORIAL.FINISH_SECOND_BTN = "เล่นไพ่ทันที"
L.TUTORIAL.SKIP = "ข้าม"
L.TUTORIAL.NEXT_STEP = "ต่อไป"
L.TUTORIAL.GUESS_TRUE_13 = "ยินดีด้วยค่ะ คุณมี A 1คู่  ไม่เลวนะ \n\nคลิกหน้าจอเพื่อเข้าสู่ขั้นตอนต่อไป "
L.TUTORIAL.GUESS_TRUE_22 = "ยินดีด้วยนะ ถูกแล้ว คุณมี 2 คู่ \n\n คลิกหน้าจอเพื่อเข้าสู่ขั้นตอนต่อไป"
L.TUTORIAL.GUESS_TRUE_27 = "ยินดีด้วยนะ ตอนนี้รูปแบบไพ่ของคุณคือฟูลเฮ้าส์ \n\nคลิกหน้าจอเพื่อเข้าสู่ขั้นตอนต่อไป"
L.TUTORIAL.GUESS_FLASE = "ตอบผิด คิดดีๆนะ"
L.TUTORIAL.RE_SELECT = "เลือกไหม่"
L.TUTORIAL.TIPS = {
    "ออกจากเมนู",
    "ชื้อชิป",
    "กดเพื่อดูข้อมูลคนอื่น ส่งชิป ใช้ไอเทมโต้ตอบ",
    "ไพ่หงาย",
    "เปิดสล็อต",
    "รูปโปรไฟล์",
    "ไพ่โฮล",
    "ปุ่มเดิมพัน",
    "แชท ส่งอีโม"
}
L.TUTORIAL.ROOM_STEP_1 = "ยินดีต้อนรับมาสู่ไพ่เท็กซัสซุปเปอร์！ครั้งแรกที่เรียนการสอนมือไหม่เสร็จแล้ว จะได้รับรางวัลการสอนมือไหม่{1}ชิป ต่อไปนี้เรามาเริ่มต้นเล่นเกมส์เถอะ\n\nคลิกหน้าจอเพื่อเข้าสู่ขั้นตอนต่อไป"
L.TUTORIAL.ROOM_STEP_2 = "ฉันเป็นสาวแจกไพ่Aliciaของพวกคุณ ทีแรก ฉันจะแจกไพ่โฮลสองใบที่เห็นได้ตนเองเท่านั้นไห้กับผู้เล่นทุกคน"
L.TUTORIAL.ROOM_STEP_3 = "หลังจากนั้นจะแจกไพ่หงาย 5 ใบ(ไพ่ชุมชน)ที่ทุกคนก็เห็นได้อยู่กลางโต๊ะตามลำดับ\n\nคลิกหน้าจอเพื่อเข้าสู่ขั้นตอนต่อไป"
L.TUTORIAL.ROOM_STEP_4 = "สุดท้ายผู้เล่นจะเลือกไพ่5ใบจากไพ่โฮลและไพ่ชุมชน แล้วประกอบเป็นไพ่ชุดที่ใหญ่ที่สุด และเปลียบเทียบกับผู้เล่นอื่น  ขนาดการ์ดแสดงอยู่ด้านซ้าย รอยัลฟลัช -สเตรทฟลัช-โฟร์การ์ด-ฟูลเฮ้าส์-ฟลัช-สเตรท-ตอง-คู่-ไพ่สูง"
L.TUTORIAL.ROOM_STEP_5 = "ตอนนี้ไพ่ชุดที่ใหญ่ที่สุดของคุณคือ รอยัลฟลัช ไพ่ชุดใหญ่สุดที่ประกอบเป็นที่ที่มีเคอร์เซอร์สว่าง\n\nคลิกหน้าจอเพื่อเข้าสู่ขั้นตอนต่อไป"
L.TUTORIAL.ROOM_STEP_6 = "เข้าใจแล้วมัยคะ ต่อไปนี้เราจะเริ่มต้นเล่นไพ่\n\nคลิกหน้าจอเพื่อเข้าสู่ขั้นตอนต่อไป"
L.TUTORIAL.ROOM_STEP_7 = "ที่เคอร์เซอร์สว่างเป็นปุ่มที่เดิมพันต่างๆ คุณสามารถกดปุ่มที่ต้องการตามรูปแบบไพ่ของตน\n\nคลิกหน้าจอเพื่อเข้าสู่ขั้นตอนต่อไป"
L.TUTORIAL.ROOM_STEP_8 = "ถึงตาของคุณแล้ว ไพ่ไม่เลวนะ \n\n กรุณากดปุ่มสู้ก่อน"
L.TUTORIAL.ROOM_STEP_11= "ผู้เล่นอื่น ๆ อีกสองคนได้เลือก CALL ดูเหมือนว่าไพ่ไม่ได้ไหญ่นะ ตอนนี้จะแจกไพ่ชุมชน3ใบแรก ที่เรียกว่าฟล็อป  \n\nคลิกหน้าจอเพื่อเข้าสู่ขั้นตอนต่อไป"
L.TUTORIAL.ROOM_STEP_13= "ไพ่ฟล็อปแจกไปแล้ว ตอนนี้รูปแบบไพ่ของคุณคืออะไรคะ"
L.TUTORIAL.ROOM_STEP_14= "ถึงตาของคุณแล้ว คิดดูก่อน จะทำอย่างไรต่อนะ ผู้เล่นอื่นอาจมีฟลัช กดปุ่มผ่านก่อนดีกว่า"
L.TUTORIAL.ROOM_STEP_16= "ผู้เล่น{1}เลือกเกทับ โดยทั่วไปเกทับหมายถึงไพ่ของเขาจะค่อนข้างดี ระวังนะ"
L.TUTORIAL.ROOM_STEP_18= "ผู้เล่น{1}เลือกหมอบ การหมอบหมายถึงแพ้ชิปที่เดิมพันทั้งหมดในรอบนี้ โดยทั่วไปเราจะหมอบเพราะไพ่ไม่ดี"
L.TUTORIAL.ROOM_STEP_19= "ถึงตาของคุณแล้ว ไพ่ไม่เลวนะ มีA1คู่ เลือกCALLได้และดูไพ่ชุมชนใบที่4"
L.TUTORIAL.ROOM_STEP_22= "ไพ่ชุมชนใบที่4แจกไปแล้ว ตอนนี้รูปแบบไพ่ของคุณคืออะไร"
L.TUTORIAL.ROOM_STEP_23= "ตอนนี้เหลือผู้เล่น2คนแล้ว รูปแบบไพ่ของคุณคือ2คู่ นับว่าดีแล้ว ลองเกทับ{1}หน่อย"
L.TUTORIAL.ROOM_STEP_25= "ผู้เล่น{1}เลือกสู้ตาม สาวแจกไพ่Aliciaขจะแจกไพ่ชุมชนใบสุดท้าย"
L.TUTORIAL.ROOM_STEP_27= "ไพ่ชุมชนใบที่5แจกไปแล้ว ตอนนี้ไพ่ชุดสุดท้ายของคุณคืออะไร"
L.TUTORIAL.ROOM_STEP_29= "{1}All-INแล้วนะ ไพ่ของเขาน่าจะดีๆ แต่ฟูลเฮ้าส์ของคุณก็ไหญ่มาก ตามเลย"
L.TUTORIAL.ROOM_STEP_32= "สุดท้ายเรามาเปิดไพ่ ไพ่ของ{1}คือฟลัช เล็กกว่าฟูลเฮ้าส์ของคุณ ยินดีด้วย คุณได้ชนะชิปกองกลางทั้งหมด"
L.TUTORIAL.ROOM_STEP_34= "เหล่านี้เป็นฟังก์ชั่นอื่น ๆ ของเกมที่คุณสามารถสำรวจเองค่ะ"

--保险箱
L.SAFE.TITLE = "ตู้นิรภัย"
L.SAFE.TAB_TEXT = {
    "ชิป",
    "เพชร"
}
L.SAFE.SAVE_MONEY = "ฝากเงิน"
L.SAFE.GET_MONEY = "ถอนเงิน"
L.SAFE.SET_PASSWORD = "ตั้งรหัสผ่าน"
L.SAFE.CHANGE_PASSWORD = "แก้รหัสผ่าน "
L.SAFE.MY_SAFE = "ตู้นิรภัยของฉัน"
L.SAFE.MY_PURSE = "เงินติดตัว"
L.SAFE.SET_PASSWORD_TIPS_1 = "กรุณากรอกรหัสผ่าน"
L.SAFE.SET_PASSWORD_TIPS_2 = "กรุณากรอกรหัสผ่านอีกครั้ง"
L.SAFE.SET_PASSWORD_TIPS_3 = "รหัสผ่านที่กรอกไม่ไม่ตรงกัน กรุณากรอกใหม่ค่ะ"
L.SAFE.SET_PASSWORD_TIPS_4 = "รหัสผ่านไม่สามารถเว้นว่างได้"
L.SAFE.SET_PASSWORD_TIPS_5 = "กรุณากรอกรหัสผ่านเพื่อเปิดตู้นิรภัย"
L.SAFE.FORGET_PASSWORD = "ลืมรหัสผ่าน"
L.SAFE.VIP_TIPS_1 = "ท่านยังไม่ได้ชื่อVIP ไม่สามารถใช้บริการได้ เป็น VIPทันทีก็สามารถใช้สิทธิพิเศษต่างๆ"
L.SAFE.VIP_TIPS_2 = "VIPของท่านหมดอายุแล้ว ไม่สามารถใช้บริการได้ เป็น VIPทันทีก็สามารถใช้สิทธิพิเศษต่างๆ"
L.SAFE.SET_PASSWORD_SUCCESS = "ตั้งรหัสผ่านสำเร็จ"
L.SAFE.SET_PASSWORD_FAILED = "ตั้งรหัสผ่านล้มเหลว กรุณาลองอีกครั้ง"
L.SAFE.CHANGE_PASSWORD_SUCCESS = "เปลี่ยนรหัสผ่านสำเร็จ"--"修改密码成功!"
L.SAFE.CHANGE_PASSWORD_FAILED = "เปลี่ยนรหัสผ่านล้มเหลว กรุณาลองอีกครั้งค่ะ"--"修改密码失败,请重试!"
L.SAFE.CHECK_PASSWORD_ERROR = "รหัสผ่านผิด กรุณาลองอีกครั้ง"
L.SAFE.CHECK_PASSWORD_FAILED = "ยืนยันรหัสผ่านล้มเหลว กรุณาลองอีกครั้ง"
L.SAFE.SAVE_MONEY_FAILED = "ฝากเงินล้มเหลว กรุณาลองอีกครั้ง"
L.SAFE.GET_MONEY_FAILED = "ถอนเงินล้มเหลว กรุณาลองอีกครั้ง"
L.SAFE.INPUT_MONEY_TIPS = "กรุณากรอกค่าที่มากกว่า 0"
L.SAFE.SET_EMAIL = "ตั้งอีเมลป้องกัน"
L.SAFE.SET_EMAIL_BTN = "กดเพื่อตั้งค่า"--"点击设置"
L.SAFE.CHANGE_EMAIL_BTN = "เปลี่ยนอีเมล"--"修改邮箱"
L.SAFE.SET_EMAIL_TIPS_1 = "กรุณาผูกอีเมลที่รับอีเมลได้ เพื่อปกป้องทรัพย์สินของท่าน อีเมลสามารถใช้ในรีเซ็ตรหัสผ่านและดำเนินการอื่น ๆ\nตั้ผูกอีเมลป้องกันครั้งแรกสำเร็จ รับรางวัล 20K ชิป"
L.SAFE.SET_EMAIL_TIPS_2 = "ผูกอีเมลสำเร็จ"
L.SAFE.SET_EMAIL_TIPS_3 = "อีเมล เข่น openpokerxxx@gmail.com"
L.SAFE.SET_EMAIL_TIPS_4 = "กรุณาผูกอีเมลที่ถูกต้อง"
L.SAFE.SET_EMAIL_TIPS_5 = "ท่านยังไม่ได้ตั้งอีเมลป้องกัน อีเมลสามารถใช้ในรีเซ็ตรหัสผ่าน"--"你还没有设置安全邮箱,设置后可通过邮箱找回密码"
L.SAFE.SET_EMAIL_TIPS_6 = "อีเมลป้องกันของท่าน {1}"--"您已经设置了安全邮箱:{1}"
L.SAFE.SET_EMAIL_SUCCESS = "ผูกอีเมลสำเร็จ"
L.SAFE.SET_EMAIL_TIPS_FAILED = "ผูกอีเมลล้มเหลว กรุณาลองอีกครั้ง"
L.SAFE.RESET_PASSWORD_TIPS_1 = "ส่งข้อมูสรีเซ็ตแล้ว กรุณาล็อกอินอีเมลทันทีและคลิกลิงค์เพื่อยืนยัน"
L.SAFE.RESET_PASSWORD_TIPS_2 = "ตั้งรหัสผ่านไหม่ กดตกลง ระบบจะส่งลิงค์ถึงอีเมลป้องกัน คลิกที่ลิงก์ภายใน 5 นาทีเพื่อรีเซ็ต"--"设置新的密码,点击确定,系统将发送验证链接到您的安全邮箱,5分钟内点击链接激活即可重置成功."
L.SAFE.RESET_PASSWORD_TIPS_3 = "ขอโทษ ท่านไม่ได้ผูกอีเมล จึงสามารถใช้บริการ กรุณาติดต่อติดต่อทีมงาน"
L.SAFE.RESET_PASSWORD_TIPS_4 = "รีเซ็ตล้มเหลว กรุณาลองอีกครั้งค่ะ"--"重置信息提交失败,请重试."
L.SAFE.RESET_PASSWORD = "รีเซ็ตรหัสผ่าน"--"重置密码"
L.SAFE.CLEAN_PASSWORD = "งดใช้รหัสผ่าน"--"清空密码"
L.SAFE.CLEAN_PASSWORD_SUCCESS = "รหัสผ่านแล้ว"--"清空密码成功!"
L.SAFE.CLEAN_PASSWORD_FAILED = "งดใช้รหัสผ่านล้มเหลว กรุณาลองอีกครั้งค่ะ"--"清空密码失败,请重试!"

--夺金岛
L.GOLDISLAND.TITLE = "แจ๊คพ๊อต"--"夺金岛"
L.GOLDISLAND.RULE_BTN = "กติกา"--"详细规则"
L.GOLDISLAND.BUY_BTN = "ชื้อรอบต่อไป"--"购买一次"
L.GOLDISLAND.ALREADY_BUY = "ชื้อแล้ว"--"已购买"
L.GOLDISLAND.PRICE = "{1}ชิป/ครั้ง"--"{1}筹码/次"
L.GOLDISLAND.AUTO_BUY = "ชื้ออัตโนมัต"--"自动购买"
L.GOLDISLAND.BUY_SUCCESS = "ชื้อแจ๊คพ๊อตรอบต่อไปสำเร็จ"--"买入下一局夺金岛成功"
L.GOLDISLAND.BUY_FAILED = "ชิปของท่านไม่พอที่จะชื้อแจ๊คพ๊อตแล้วค่ะ"--"您身上的筹码不足以购买下一局的夺金岛了"
L.GOLDISLAND.BUY_TIPS = "ต้องนั่งลงจึงสามารถชื้อแจ๊คพ๊อตได้"--"必须坐下,才能购买下一局的夺金岛"
L.GOLDISLAND.RULE_TITLE = "กติกา"--"夺金岛规则说明"
L.GOLDISLAND.RULE_POOL = "แจ๊คพ๊อต"--"奖池:"
L.GOLDISLAND.RULE_DESC = [[
1.เกมแจ๊คพ๊อตเล่นได้ในห้องสมอลบลายด์มากกว่า3000เมื่อผู้เล่นนั่งลง จะเสีย2000ชิป（หักจากชิปนำเข้า）ต่อครั้งในการเล่น ชิป2000นี้จะสะสมในเงินกองกลาง

2. ผู้เล่นเข้ารวมที่ได้ไพ่ที่กำหนดไว้ ก็จะได้รับชิปจากเงินกองกลางแจ๊คพ๊อต 
รอยัลฟลัช:ได้80%เงินกองกลาง
สเตรทฟลัช:ได้30%เงินกองกลาง
โฟร์การ์ด:ได้10%เงินกองกลาง

3.ผู้เล่นเข้ารวมแจ๊คพ๊อตต้องสู้ถึงสุดท้าย（เปิดไพ่ทั้งหมด）หากผู้เล่นหมอบกลางทางจะไม่สามารถรับรางวัลชิป และหากแจกไพ่ไม่ครบ5ใบเนื่องจากผู้เล่นอื่นหมอบไป ทุกคนจะไม่สามารถรับรางวัล ผู้เล่นต้องสู้ถึงการเปิดไพ่เปลี่ยนกัน（ไม่ต้องชนะ）จึงสามารถรับรางวัลจากแจ๊คพ๊อต

4.ระบบจะส่งชิปถึงบัญชีผู้เล่นที่ได้รางวัลโดยอัตโนมัต

5.กดปุมแจ๊คพ๊อตเพื่อรวมเกม ผู้เล่นสามารถชื้อครั้งเดียว หรือชื้ออัตโนมัต
]]
L.GOLDISLAND.REWARD_TITLE = "ยินดีต้วย ชนะแจ๊คพ๊อต"--"恭喜赢得夺金岛"
L.GOLDISLAND.REWARD_BTN = "โอเค"--"我知道了"
L.GOLDISLAND.CARD_TYPE = "รูปแบบไพ่ของท่านคือ{1}"--"您的牌型为:{1}"
L.GOLDISLAND.REWARD_NUM = "ชนะเงินกองกลาง{1}%ของแจ๊คพ๊อต"--"获得夺金岛{1}%的奖池:"
L.GOLDISLAND.REWARD_TIPS = "รางวัลได้ส่งถึงบัญชีของท่านแล้วค่ะ"--"奖金已发送至您的个人账户中"
L.GOLDISLAND.BROADCAST_REWARD_TIPS = "ยินดีต้วย ผู้เล่น{1}ได้แทงถูก{2}และชนะชิป{3}ในแจ๊คพ๊อต"--"恭喜玩家{1}在夺金岛压中{2}获得{3}筹码的奖金!"

--支付引导
L.CHECKOUTGUIDE.BTN_TITLE = "วิธีชำระค่าโทรผ่าน\nGoogle Play"
L.CHECKOUTGUIDE.TITLE = "วิธีชำระผ่านทาง"
L.CHECKOUTGUIDE.TAB_TEXT = {
    "ชำระผ่านค่าโทร",
    "ชำระผ่านบัตระนาคาร"
}
L.CHECKOUTGUIDE.SMS_TITLE = "ชำระเงินผ่านค่าไทรศัพท์(สนับสนุนชิมAIS/Dtacเท่านั้น)"
L.CHECKOUTGUIDE.SMS_STEP = {
    "เข้าห้างของเกม->เลือกGooglePlay->กดสินค้าที่จะชื้อ->ระบบจะขึ้นหน้าต่างยืนยันการชื้อตามรูป->กดเครื่องหมาย\"ลูกศร\"",
    "กด\"เรียกเก็บเงินผ่านบัญชีAISหรือDtac\" (ขึ้นอยู่กับชิมของท่าน)",
    "พิมพ์รหัสผ่านของบัญชีgmail แล้วกดยืนยัน",
    "เติมเงินสำเร็จ",
}
L.CHECKOUTGUIDE.CARD_TITLE = "ชำระผ่านบัตรธนาคาร"
L.CHECKOUTGUIDE.CARD_STEP = {
    "เข้าห้างของเกม->เลือกGooglePlay->กดสินค้าที่จะชื้อ->ระบบจะขึ้นหน้าต่างยืนยันการชื้อตามรูป->กดเครื่องหมาย\"ลูกศร\"",
    "กด\"เพิ่มบัตรเครดิตหรือบัตรเดบิต\"",
    "เพิ่มรสยละเอียดเพื่อเชื่อมโยงบัคร",
    "หลังเชื่อมโยงบัตรเรียบร้อยแล้ว เมื่อชื้อสินค้าระบบจะขึ้นหน้าต่างยืนยันการชื้อ -＞กด\"ชื้อ\"",
    "พิมพ์รหัสผ่านของบัญชีgmail แล้วกดยืนยัน",
    "เติมเงินสำเร็จ",
}
L.CHECKOUTGUIDE.TRUE_WALLET_TITLE = "ขั้นตอนการเปิดใช้บัตรเครดิตมาสเตอร์การ์ดเสมือน"
L.CHECKOUTGUIDE.TRUE_WALLET_STEP = "1.โหลดแอพ true wallet\n2.กด\"we card\" สมัครสมาชิก เพื่อรับบัตรเครดิตมาสเตอร์การ์ดเสมือน"
L.CHECKOUTGUIDE.TRUE_WALLET_MORE = "สามารถอ่านข้อมูลเกี่ยวกับ true wallet เพิ่มเติมได้ที่"

--绑定账号
L.BIND.BTN_TITLE = "อัพเกรดบัญชี+{1}"
L.BIND.TITLE = "อัพเกรดบัญชีความปลอดภัยฟรี"
L.BIND.BTN_TITLE_2 = {
    "ผูกกับบัญชีFacebook",
    "ผูกกับบัญชีLine",
    "ผูกกับบัญชีVK"
}
L.BIND.ACCOUNT = {
    "Facebook",
    "Line",
    "VK"
}
L.BIND.SUCCESS_TITLE = "การผูกสำเร็จ"
L.BIND.FAILED_TITLE = "การผูกล้มเหลว"
L.BIND.GET_REWARD = "รีบรับนะ"
L.BIND.GET_REWARD_FAILED = "ไม่สามารถรับรางวัลได้ โปรดลองอีกครั้ง"
L.BIND.GET_REWARD_TIPS = "คุณผูกบัญชีนักท่องเที่ยวเข้ากับ {1} เรียบร้อยแล้ว คุณสามารถเลือกที่จะเข้าสู่ระบบได้ทุกวิถีในภายหลัง และได้รับรางวัลบัญชีที่ปลอดภัย{2}ซิป"
L.BIND.FAILED_TIPS = "ขออภัยค่ะ บัญชีนี้ได้ลงทะเบียนแล้วสำหรับเกม\nคุณสามารถเลือกบัญชีอื่นเพื่อผูกใหม่หรือเข้าสู่บัญชีที่มีอยู่ได้โดยตรง"
L.BIND.FAILED_TIPS_2 = "การผูกบัญชีล้มเหลวโปรดลองอีกครั้ง"
L.BIND.GOTO_LOGIN = "เข้าสู่ระบบโดยตรง"
L.BIND.RETRY = "ผูกใหม่"
L.BIND.CANCELED = "ยกเลิกการผูก"

--支付引导
L.PAYGUIDE.FIRST_GOODS_DESC = {
    "รับVIP",
    "รับรูปไดนามิกVIP",
}
L.PAYGUIDE.FIRST_GOODS_DESC_2 = {
    "7วัน VIP1",
    "รูปไดนามิก",
    "3 เท่ามากที่สุด"
}
L.PAYGUIDE.GOTO_STORE = "ไปห้าง"
L.PAYGUIDE.GET_CARSH_REWARD = "รับ{1}รางวัลด่วน"
L.PAYGUIDE.FIRST_PAY_TIPS = "รับของขวัญข้างต้นได้หากซื้อซิปในห้าง"
L.PAYGUIDE.BUY_PRICE_1 = "{1}"
L.PAYGUIDE.BUY_PRICE_2 = "ราคาเดิม{1}"
L.PAYGUIDE.ROOM_FIRST_PAY_TIPS = "คนละซื้อได้1ครั้ง"
return L
